[
  {
    "id": 1,
    "name": "Aardonyx",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/aardonyx.jpg",
    "typeOfDinosaur": "prosauropod",
    "length": 8,
    "weight": 1700,
    "diet": "herbivorous",
    "whenLived": "Early Jurassic, 199-189 million years ago",
    "foundIn": "South Africa",
    "taxonomy": "Dinosauria, Saurischia, Sauropodomorpha, Prosauropoda, Anchisauria",
    "namedBy": "Yates, Bonnan, Neveling, Chinsamy and Blackbeard 2010 (2009)",
    "typeSpecies": "celestae",
    "description": "Aardonyx is known from 2 immature individuals. Adults would have been much larger, probably over 10m.Aardonyx would have been largely bipedal (walking on 2 legs) but also capable of walking on all 4 legs. This and its way of feeding are transitional features between those of basal sauropodomorphs and the more derived sauropods (large dinosaurs that walked on all fours) that came later."
  },
  {
    "id": 2,
    "name": "Abelisaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/abeli.jpg",
    "typeOfDinosaur": "large theropod",
    "length": 9,
    "weight": 1600,
    "diet": "carnivorous",
    "whenLived": "Late Cretaceous, 74-70 million years ago",
    "foundIn": "Argentina",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Neotheropoda, Ceratosauria, Abelisauridae, Abelisaurinae",
    "namedBy": "Bonaparte and Novas (1985)",
    "typeSpecies": "comahuensis",
    "description": "Abelisaurus comahuensis was a carnivorous dinosaur that lived during the Late Cretaceous period, approximately 80 million years ago. It was first discovered in Argentina and is characterized by its robust skull, powerful jaws filled with sharp teeth, and relatively small forelimbs compared to its large hind limbs. Abelisaurus likely preyed on smaller dinosaurs and other animals of its time, using its speed and agility to hunt. Despite its fearsome appearance, much about Abelisaurus, including its behavior and social structure, remains a subject of scientific debate and ongoing research."
  },
  {
    "id": 3,
    "name": "Achelousaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/achelou.jpg",
    "typeOfDinosaur": "ceratopsian",
    "length": 6,
    "weight": 2600,
    "diet": "herbivorous",
    "whenLived": "Late Cretaceous, 83-70 million years ago",
    "foundIn": "USA",
    "taxonomy": "Dinosauria, Ornithischia, Neornithischia, Cerapoda, Marginocephalia, Ceratopsia, Neoceratopsia, Coronosauria, Ceratopsidae, Centrosaurinae",
    "namedBy": "Sampson  (1995)",
    "typeSpecies": "horneri",
    "description": "Achelousaurus was a herbivorous dinosaur that lived during the Late Cretaceous period, around 74 to 65 million years ago. It belonged to the group of ceratopsian dinosaurs, characterized by their frilled skulls and often elaborate head ornaments. Achelousaurus was first discovered in Montana, USA, and is known for its distinctive nasal horn, which curved forward and resembled a small hook. This dinosaur likely roamed in herds, grazing on vegetation with its sharp beak and teeth. Its name, Achelousaurus, is derived from Achelous, a Greek river deity, due to the abundance of water-related fossil finds in the region where it was discovered."
  },
  {
    "id": 4,
    "name": "Achillobator",
    "imageSrc": "N/A",
    "typeOfDinosaur": "large theropod",
    "length": 5,
    "weight": 280,
    "diet": "carnivorous",
    "whenLived": "Late Cretaceous, 99-84 million years ago",
    "foundIn": "Mongolia",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Dromaeosauridae",
    "namedBy": "Perle, Norell and Clark (1999)",
    "typeSpecies": "giganteus",
    "description": "Achillobator was a carnivorous dinosaur that lived during the Late Cretaceous period, approximately 90 to 80 million years ago. This theropod dinosaur belonged to the dromaeosaurid family, which includes famous relatives like Velociraptor. Achillobator was discovered in Mongolia and was a formidable predator, equipped with sharp teeth, a long tail for balance, and sickle-shaped claws on its hind limbs, which it likely used to grasp and disembowel prey. It was a swift and agile hunter, possibly hunting in packs to take down larger prey such as herbivorous dinosaurs. Despite its smaller size compared to some other predators of its time, Achillobator was an apex predator in its ecosystem."
  },
  {
    "id": 5,
    "name": "Acrocanthosaurus",
    "imageSrc": "N/A",
    "typeOfDinosaur": "large theropod",
    "length": 12,
    "weight": 5800,
    "diet": "carnivorous",
    "whenLived": "Early Cretaceous, 115-105 million years ago",
    "foundIn": "Canada, USA",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Carcharodontosauridae",
    "namedBy": "Stovall and Langston (1950)",
    "typeSpecies": "atokensis",
    "description": "Acrocanthosaurus atokensis was a large theropod dinosaur that lived during the Early Cretaceous period, around 115 to 105 million years ago. Known for its distinctive high spines along its back, Acrocanthosaurus roamed the ancient landscapes of North America, particularly in what is now Oklahoma, Texas, and possibly other southern states. It was one of the largest carnivorous dinosaurs of its time, measuring up to 38 feet (11.5 meters) in length and weighing around 6 tons. This apex predator likely preyed on large herbivorous dinosaurs like sauropods and ornithopods, using its powerful jaws filled with serrated teeth to hunt and consume its prey. Despite its formidable appearance, Acrocanthosaurus, like many dinosaurs, still holds many mysteries for paleontologists, who continue to study and learn more about this fascinating predator."
  },
  {
    "id": 6,
    "name": "Aegyptosaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/aegypto.jpg",
    "typeOfDinosaur": "sauropod",
    "length": 15,
    "weight": 7600,
    "diet": "herbivorous",
    "whenLived": "Late Cretaceous, 98-93 million years ago",
    "foundIn": "Egypt",
    "taxonomy": "Dinosauria, Saurischia, Sauropodomorpha, Sauropoda, Eusauropoda, Neosauropoda, Macronaria, Camarasauromorpha, Titanosauriformes, Titanosauria",
    "namedBy": "Stromer (1932)",
    "typeSpecies": "baharijensis",
    "description": "Aegyptosaurus was a herbivorous sauropod dinosaur that lived during the Late Cretaceous period, approximately 95 to 70 million years ago. It was discovered in Egypt and was part of the larger group of titanosaurs, known for their enormous size and long necks. Aegyptosaurus reached lengths of around 50 to 70 feet (15 to 21 meters) and weighed several tons. It had a relatively long neck and tail, and its body was supported by four sturdy legs. Aegyptosaurus likely grazed on vegetation, using its wide, peg-like teeth to strip leaves from trees and bushes. Although it lived during the same time period as other famous dinosaurs like Tyrannosaurus rex, Aegyptosaurus was a peaceful giant, browsing the ancient landscapes in search of food."
  },
  {
    "id": 7,
    "name": "Afrovenator",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/afrovenator.jpg",
    "typeOfDinosaur": "large theropod",
    "length": 9,
    "weight": 800,
    "diet": "carnivorous",
    "whenLived": "Early Cretaceous, 132-121 million years ago",
    "foundIn": "Niger",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Megalosauridae, Eustreptospondylinae",
    "namedBy": "Sereno, Wilson, Larsson, Dutheil and Sues (1944)",
    "typeSpecies": "abakensis",
    "description": "Afrovenator abakensis was a carnivorous dinosaur that lived during the Early Jurassic period, around 170 million years ago. It was discovered in what is now Niger, Africa, and belonged to the group of theropod dinosaurs, which includes famous predators like Tyrannosaurus rex. Afrovenator was a medium-sized predator, measuring approximately 25 feet (7.5 meters) in length and weighing around 1 ton. It had sharp teeth and claws, with a long, slender body and tail, indicating it was likely an agile and swift hunter. Its name, Afrovenator, means 'African hunter,' reflecting its predatory lifestyle. Despite its relatively small size compared to later theropods, Afrovenator was a top predator in its environment, preying on smaller dinosaurs and other animals of its time."
  },
  {
    "id": 8,
    "name": "Agilisaurus",
    "imageSrc": "N/A",
    "typeOfDinosaur": "small ornithischian",
    "length": 1.5,
    "weight": 10,
    "diet": "herbivorous",
    "whenLived": "Late Jurassic, 169-159 million years ago",
    "foundIn": "China",
    "taxonomy": "Dinosauria, Ornithischia, Ornithopoda, Euornithopoda",
    "namedBy": "Peng (1990)",
    "typeSpecies": "louderbacki",
    "description": "Agilisaurus was a small herbivorous dinosaur that lived during the Middle Jurassic period, approximately 165 million years ago. Discovered in China, it belonged to the group of ornithischian dinosaurs known as ornithopods, which were characterized by their bipedal stance and herbivorous diet. Agilisaurus was relatively small, measuring about 3 to 4 feet (1 to 1.2 meters) in length and weighing around 5 to 10 kilograms. It had a lightweight body, long hind legs, and probably moved swiftly on two legs to evade predators. Despite its small size, Agilisaurus likely played an important role in its ecosystem as prey for larger predators and as a browser of low-lying vegetation."
  },
  {
    "id": 9,
    "name": "Alamosaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/alamo.jpg",
    "typeOfDinosaur": "sauropod",
    "length": 21,
    "weight": 38000,
    "diet": "herbivorous",
    "whenLived": "Late Cretaceous, 70-66 million years ago",
    "foundIn": "USA",
    "taxonomy": "Dinosauria, Saurischia, Sauropodomorpha, Sauropoda, Eusauropoda, Neosauropoda, Macronaria, Camarasauromorpha, Titanosauriformes, Titanosauria, Lithostrotia",
    "namedBy": "Gilmore (1922)",
    "typeSpecies": "sanjuanensis",
    "description": "Alamosaurus was a massive, long-necked sauropod dinosaur that lived during the Late Cretaceous period, around 70 to 66 million years ago. It inhabited what is now North America, particularly the region that encompasses modern-day Texas, New Mexico, Utah, and Mexico. Alamosaurus was one of the last sauropods to roam the Earth, and it was among the largest, reaching lengths of up to 60 to 70 feet (18 to 21 meters) and weighing an estimated 30 to 60 tons. Its long neck and tail, along with its four sturdy legs, helped support its immense body. Alamosaurus likely grazed on vegetation such as ferns, cycads, and conifers, using its peg-like teeth to strip leaves and branches. Despite its size, Alamosaurus may have faced threats from large predators like Tyrannosaurus rex, although its sheer bulk likely provided some defense against attacks. This is the only Late Cretaceous sauropod that has been found in North America."
  },
  {
    "id": 10,
    "name": "Albertaceratops",
    "imageSrc": "N/A",
    "typeOfDinosaur": "ceratopsian",
    "length": 7,
    "weight": 2800,
    "diet": "herbivorous",
    "whenLived": "Late Cretaceous, 80-75 million years ago",
    "foundIn": "Canada, USA",
    "taxonomy": "Dinosauria, Ornithischia",
    "namedBy": "Ryan 2007",
    "typeSpecies": "nesmoi",
    "description": "This dinosaur is known from a single, well-preserved skull from Alberta and material from a bone bed in Montana, including almost the entire skeleton, found in August 2001. It has long brow horns, unlike other members of the centrosaurine subfamily."
  },
  {
    "id": 12,
    "name": "Alectrosaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/alectro.jpg",
    "typeOfDinosaur": "large theropod",
    "length": 5,
    "weight": 600,
    "diet": "carnivorous",
    "whenLived": "Late Cretaceous, 90-70 million years ago",
    "foundIn": "China, Mongolia",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Tyrannosauroidea",
    "namedBy": "Gilmore (1933)",
    "typeSpecies": "olseni",
    "description": "Alectrosaurus was a medium-sized theropod dinosaur that lived during the Late Cretaceous period, approximately 75 to 70 million years ago. It was discovered in what is now Mongolia and belonged to the group of carnivorous dinosaurs known as tyrannosaurs. Although smaller than its famous relative Tyrannosaurus rex, Alectrosaurus was still a formidable predator, measuring about 15 to 20 feet (4.5 to 6 meters) in length and weighing around 500 to 1,000 kilograms. It had a large head with sharp teeth and powerful jaws, which it likely used to hunt and feed on smaller dinosaurs and other animals of its time. Alectrosaurus is an important part of our understanding of theropod diversity during the Late Cretaceous, providing valuable insights into the evolution and ecology of these iconic predators."
  },
  {
    "id": 13,
    "name": "Alioramus",
    "imageSrc": "N/A",
    "typeOfDinosaur": "large theropod",
    "length": 6,
    "weight": 2000,
    "diet": "carnivorous",
    "whenLived": "Late Cretaceous, 71-66 million years ago",
    "foundIn": "Mongolia",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Tyrannosauroidea",
    "namedBy": "Kurzanov (1976)",
    "typeSpecies": "remotus",
    "description": "Alioramus, a large theropod dinosaur, is estimated to have weighed between 1.5 to 2 tons. It was a carnivorous predator that lived during the Late Cretaceous period, approximately 71 to 66 million years ago in what is now Mongolia. Alioramus belongs to the taxonomic group Tyrannosauroidea and was named by Kurzanov in 1976. The type species of Alioramus is remotus. The dinosaur is known for its distinctive skull, which shows small bumps near the nose."
  },
  {
    "id": 15,
    "name": "Alvarezsaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/alvarez.jpg",
    "typeOfDinosaur": "small theropod",
    "length": 2,
    "weight": 100,
    "diet": "carnivorous",
    "whenLived": "Late Cretaceous, 89-85 million years ago",
    "foundIn": "Argentina",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Neotheropoda, Tetanurae, Avetheropoda, Coelurosauria, Tyrannoraptora, Maniraptoriformes, Maniraptora, Alvarezsauridae",
    "namedBy": "Bonaparte (1991)",
    "typeSpecies": "calvoi",
    "description": "Alvarezsaurus, a small theropod dinosaur, likely weighed between 50 to 100 kilograms. It was a carnivorous dinosaur that lived during the Late Cretaceous period, around 89 to 85 million years ago in what is now Argentina. Belonging to the taxonomic group Alvarezsauridae, Alvarezsaurus was named by Bonaparte in 1991. The type species of Alvarezsaurus is calvoi. It is believed that Alvarezsaurus may have been feathered."
  },
  {
    "id": 17,
    "name": "Ammosaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/ammo.jpg",
    "typeOfDinosaur": "prosauropod",
    "length": 5,
    "weight": 1000,
    "diet": "herbivorous",
    "whenLived": "Early Jurassic, 195-180 million years ago",
    "foundIn": "USA",
    "taxonomy": "Dinosauria, Saurischia, Sauropodomorpha, Prosauropoda, Anchisauria, Anchisauridae",
    "namedBy": "Marsh (1891)",
    "typeSpecies": "major",
    "description": "Ammosaurus, a prosauropod dinosaur, is estimated to have weighed between 500 kilograms to 1 ton. It was a herbivorous dinosaur that lived during the Early Jurassic period, approximately 195 to 180 million years ago in what is now the USA. Ammosaurus belongs to the taxonomic group Anchisauridae and was named by Marsh in 1891. The type species of Ammosaurus is major. This dinosaur was very similar in appearance to Anchisaurus."
  },
  {
    "id": 18,
    "name": "Ampelosaurus",
    "imageSrc": "N/A",
    "typeOfDinosaur": "sauropod",
    "length": 15,
    "weight": 15000,
    "diet": "herbivorous",
    "whenLived": "Late Cretaceous, 71-66 million years ago",
    "foundIn": "France",
    "taxonomy": "Dinosauria, Saurischia, Sauropodomorpha, Sauropoda, Eusauropoda, Neosauropoda, Macronaria, Camarasauromorpha, Titanosauriformes, Titanosauria, Lithostrotia",
    "namedBy": "Le Loeuff (1995)",
    "typeSpecies": "atacis",
    "description": "Ampelosaurus, a sauropod dinosaur, is estimated to have weighed between 10 to 15 tons. It was a herbivorous dinosaur that lived during the Late Cretaceous period, approximately 71 to 66 million years ago in what is now France. Ampelosaurus belongs to the taxonomic group Titanosauria and was named by Le Loeuff in 1995. The type species of Ampelosaurus is atacis. Fossil remains of Ampelosaurus include teeth, postcranial bones, and osteoderms ('armour plating')."
  },
  {
    "id": 19,
    "name": "Amygdalodon",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/Amygdalodon.jpg",
    "typeOfDinosaur": "sauropod",
    "length": 15,
    "weight": 13000,
    "diet": "herbivorous",
    "whenLived": "Mid Jurassic, 177-169 million years ago",
    "foundIn": "Argentina",
    "taxonomy": "Dinosauria, Saurischia, Sauropodomorpha, Sauropoda, Eusauropoda",
    "namedBy": "Cabrera (1947)",
    "typeSpecies": "patagonicus",
    "description": "Amygdalodon, a sauropod dinosaur, is estimated to have weighed between 10 to 15 tons. It was a herbivorous dinosaur that lived during the Mid Jurassic period, approximately 177 to 169 million years ago in what is now Argentina. Amygdalodon belongs to the taxonomic group Eusauropoda and was named by Cabrera in 1947. Fossil remains of Amygdalodon include a single partial skeleton."
  },
  {
    "id": 20,
    "name": "Anchiceratops",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/anchi2.jpg",
    "typeOfDinosaur": "ceratopsian",
    "length": 6,
    "weight": 2500,
    "diet": "herbivorous",
    "whenLived": "Late Cretaceous, 74-70 million years ago",
    "foundIn": "Canada",
    "taxonomy": "Dinosauria, Ornithischia, Neornithischia, Cerapoda, Marginocephalia, Ceratopsia, Neoceratopsia, Coronosauria, Ceratopsidae, Chasmosaurinae",
    "namedBy": "Brown (1914)",
    "typeSpecies": "ornatus",
    "description": "Anchiceratops, a ceratopsian dinosaur, is estimated to have weighed between 2 to 3 tons. It was a herbivorous dinosaur that lived during the Late Cretaceous period, approximately 74 to 70 million years ago in what is now Canada. Anchiceratops belongs to the taxonomic group Ceratopsidae and was named by Brown in 1914. The type species of Anchiceratops is ornatus."
  },
  {
    "id": 21,
    "name": "Anchisaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/anchi.jpg",
    "typeOfDinosaur": "prosauropod",
    "length": 2,
    "weight": 750,
    "diet": "herbivorous",
    "whenLived": "Early Jurassic, 190 million years ago",
    "foundIn": "USA",
    "taxonomy": "Dinosauria, Saurischia, Sauropodomorpha, Prosauropoda, Anchisauria, Anchisauridae",
    "namedBy": "Marsh (1885)",
    "typeSpecies": "polyzelous",
    "description": "Anchisaurus, a prosauropod dinosaur, is estimated to have weighed between 500 kilograms to 1 ton. It was a herbivorous dinosaur that lived during the Early Jurassic period, approximately 190 million years ago in what is now the USA. Anchisaurus belongs to the taxonomic group Anchisauridae and was named by Marsh in 1885. The type species of Anchisaurus is polyzelous."
  },
  {
    "id": 23,
    "name": "Anserimimus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/anseri.jpg",
    "typeOfDinosaur": "large theropod",
    "length": 3.5,
    "weight": 750,
    "diet": "carnivorous",
    "whenLived": "Late Cretaceous, 84-66 million years ago",
    "foundIn": "Mongolia",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Ornithomimosauria, Ornithomimidae",
    "namedBy": "Barsbold (1988)",
    "typeSpecies": "planinychus",
    "description": "Anserimimus, a large theropod dinosaur, is estimated to have weighed between 500 kilograms to 1 ton. It was a carnivorous dinosaur that lived during the Late Cretaceous period, approximately 84 to 66 million years ago in what is now Mongolia. Anserimimus belongs to the taxonomic group Ornithomimidae and was named by Barsbold in 1988. The type species of Anserimimus is planinychus."
  },
  {
    "id": 24,
    "name": "Antarctosaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/antarcto.jpg",
    "typeOfDinosaur": "sauropod",
    "length": 18,
    "weight": 50000,
    "diet": "herbivorous",
    "whenLived": "Late Cretaceous, 84 million years ago",
    "foundIn": "Argentina, Chile, Uruguay",
    "taxonomy": "Dinosauria, Saurischia, Sauropodomorpha, Sauropoda, Eusauropoda, Neosauropoda, Macronaria, Camarasauromorpha, Titanosauriformes, Titanosauria, Lithostrotia",
    "namedBy": "von Huene (1929)",
    "typeSpecies": "wichmannianus",
    "description": "Antarctosaurus was a genus of sauropod dinosaur that lived during the Late Cretaceous period, approximately 84 million years ago. Fossils of Antarctosaurus have been found in Argentina, Chile, and Uruguay. It was one of the largest dinosaurs, estimated to have weighed between 40 to 60 tons and reaching lengths of up to 18 meters."
  },
  {
    "id": 25,
    "name": "Apatosaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/apatosaurus-art.jpg",
    "typeOfDinosaur": "sauropod",
    "length": 21,
    "weight": 20000,
    "diet": "herbivorous",
    "whenLived": "Late Jurassic, 152-145 million years ago",
    "foundIn": "USA",
    "taxonomy": "Dinosauria, Saurischia, Sauropodomorpha, Sauropoda, Eusauropoda, Neosauropoda, Diplodocoidea, Diplodocidae",
    "namedBy": "Marsh (1877)",
    "typeSpecies": "ajax",
    "description": "Apatosaurus was a large sauropod dinosaur that lived during the Late Jurassic period, approximately 152 to 145 million years ago. Fossils of Apatosaurus have been found in what is now the United States. It was a herbivorous dinosaur, known for its long neck and whip-like tail. Apatosaurus weighed between 16 to 22 tons and reached lengths of up to 21 meters."
  },

{
    "id": 26,
    "name": "Aragosaurus",
    "imageSrc": "N/A",
    "typeOfDinosaur": "sauropod",
    "length": 18,
    "weight": 3500,
    "diet": "herbivorous",
    "whenLived": "Early Cretaceous, 132-121 million years ago",
    "foundIn": "Spain",
    "taxonomy": "Dinosauria, Saurischia, Sauropodomorpha, Sauropoda, Eusauropoda",
    "namedBy": "Sanz, Buscalioni, Casanovas and SanafÃ© (1987)",
    "typeSpecies": "ischiadicus",
    "description": "Aragosaurus was a large sauropod dinosaur that lived during the Early Cretaceous period, approximately 132 to 121 million years ago. It is known from fossils found in Spain. Aragosaurus belonged to the group Eusauropoda and is estimated to have weighed between 30 to 40 tons, with a length of around 18 meters. The type species of Aragosaurus is ischiadicus."
  },
  {
    "id": 27,
    "name": "Aralosaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/Aralosaurus.jpg",
    "typeOfDinosaur": "large ornithopod",
    "length": 8,
    "weight": 3500,
    "diet": "herbivorous",
    "whenLived": "Late Cretaceous, 94-84 million years ago",
    "foundIn": "Kazakhstan",
    "taxonomy": "Dinosauria, Ornithischia, Ornithopoda, Hadrosauridae, Euhadrosauria, Hadrosaurinae",
    "namedBy": "Rozhdestvensky (1968)",
    "typeSpecies": "tuberiferus",
    "description": "Aralosaurus was a large ornithopod dinosaur that lived during the Late Cretaceous period, approximately 94 to 84 million years ago in what is now Kazakhstan. It belonged to the family Hadrosauridae and is estimated to have weighed between 3 to 4 tons, with a length of about 8 meters. The type species of Aralosaurus is tuberiferus."
},
  {  
    "id": 28,
    "name": "Archaeoceratops",
    "imageSrc": "N/A",
    "typeOfDinosaur": "ceratopsian",
    "length": 1.3,
    "weight": 25,
    "diet": "herbivorous",
    "whenLived": "Early Cretaceous, 121-99 million years ago",
    "foundIn": "China",
    "taxonomy": "Dinosauria, Ornithischia, Neornithischia, Cerapoda, Marginocephalia, Ceratopsia, Neoceratopsia",
    "namedBy": "Dong and Azuma (1987)",
    "typeSpecies": "oshimai",
    "description": "Archaeoceratops was a small ceratopsian dinosaur that lived during the Early Cretaceous period, approximately 121 to 99 million years ago. Fossils of Archaeoceratops have been found in China. It belonged to the group Neoceratopsia and is estimated to have weighed between 20 to 30 kilograms, with a length of about 1.3 meters. The type species of Archaeoceratops is oshimai."
  },
  {
    "id": 29,
    "name": "Archaeopteryx",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/archaeopteryx.jpg",
    "typeOfDinosaur": "small theropod",
    "length": 0.5,
    "weight": 0.13,
    "diet": "carnivorous",
    "whenLived": "Late Jurassic, 149-145 million years ago",
    "foundIn": "Germany",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Paraves, Archaeopterygidae",
    "namedBy": "Mayer (1861)",
    "typeSpecies": "lithographica",
    "description": "Archaeopteryx was a small, bird-like dinosaur. It lived during the Late Jurassic Period in what is now Europe.The discovery of the first Archaeopteryx fossil in Germany in 1861 caused a lot of confusion. No birds were known from so far back. Some people even thought it might be an angel.Since then, multiple fossils of Archaeopteryx have been discovered. Many show clear evidence of long feathers. But we don't know whether Archaeopteryx was fully able to fly or if it could only glide.Archaeopteryx also has a common name - Urvogel, a German name meaning 'primeval bird'.Strictly speaking, all birds are dinosaurs. But not all dinosaurs are birds. Scientists sometimes use the term 'non-avian dinosaurs' when talking about prehistoric dinosaurs that aren't birds.The line between bird and non-avian dinosaur can be vague, and many experts have discussed which way to class Archaeopteryx. For many years, scientists spoke about it as an ancient bird. These days, many people believe it should be called a dinosaur.Ultimately, categories like bird and non-avian dinosaur are invented by humans. The natural world doesn't always fit neatly into them. Animals such as Archaeopteryx that could sit across two or more categories are sometimes called transitional fossils.While Archaeopteryx is sometimes called the first bird or the earliest bird, scientists now think that there could be even older bird ancestors. Dinosaurs such as Anchiornis and Aurornis might sit even further back on the bird branch of the dinosaur family tree. If so, they're even earlier relatives of true birds. It's very difficult to say for sure.Archaeopteryx had some features in common with the birds of today. It had broad feathered wings and a small body, roughly the size of a magpie.After comparing its eyes to those of modern birds and reptiles, experts concluded that Archaeopteryx was probably diurnal. This means that it would have been active during the day and slept at night, like many of today's birds.We don't know whether Archaeopteryx mostly lived on the ground or in trees. Some scientists think it might have been equally comfortable with either, like a crow.Unlike modern birds, however, Archaeopteryx had sharp teeth and a long, bony tail.Many specimens of Archaeopteryx have been recovered over the years. All are from the limestone quarries near Solnhofen in Germany.In the Jurassic Period, this area was a lagoon surrounded by sub-tropical islands. Other small creatures such as insects and lizards - which Archaeopteryx may have preyed on - have been unearthed there too. So have some pterosaurs - flying reptiles - and the small dinosaur Compsognathus.The first Archaeopteryx fossil ever found was a single feather.Later, full skeletons were discovered showing feather impressions. We bought the first of these in 1862. It is now known as 'the London specimen' and is on display in our Cadogan gallery.There has since been debate over whether the first feather discovered really belongs to Archaeopteryx.Two years before the discovery of Archaeopteryx, Charles Darwin had just written On the Origin of Species. The book was the first to lay out the theory of evolution.Many people back then - scientists included - strongly disagreed with Darwin's concept and claimed that it wasn't possible for animals to evolve over time. But the discovery of the Archaeopteryx fossils, clearly showing a feathered and bird-like dinosaur, seemed to prove that dinosaurs had evolved into birds.Even 100 years later, there were still those who didn't accept it. Some people published articles claiming that the feathers must be fake. The controversy didn't last long, however, as our scientists were able to show that the fossils were real.The discovery of Archaeopteryx was a landmark moment for dinosaur scientists, and it is still considered to be one of the most important finds in history.It's usually almost impossible for scientists to know what colour a dinosaur would have been in life.But thanks to modern scanning technology, experts have been able to find out the colour of one Archaeopteryx wing feather - which seems to have been jet-black.We don't know whether Archaeopteryx was black all over or only on its wings."
  },
  {
    "id": 30,
    "name": "Archaeornithomimus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/archaeorn.jpg",
    "typeOfDinosaur": "small theropod",
    "length": 3.5,
    "weight": 150,
    "diet": "carnivorous",
    "whenLived": "Late Cretaceous, 95-70 million years ago",
    "foundIn": "China, Uzbekistan",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Ornithomimosauria, Ornithomimidae",
    "namedBy": "Russell (1972)",
    "typeSpecies": "asiaticus",
    "description": "Archaeornithomimus, a small theropod dinosaur, roamed the earth during the Late Cretaceous period, approximately 95 to 70 million years ago. Found in regions spanning China to Uzbekistan, this agile carnivore likely subsisted on a diet primarily composed of meat. Named by Russell in 1972, its fossil remains contribute to our understanding of the diversity of ornithomimids during the Mesozoic era."
},
{
    "id": 32,
    "name": "Arrhinoceratops",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/Arrhinoceratops.jpg",
    "typeOfDinosaur": "ceratopsian",
    "length": 6,
    "weight": 800,
    "diet": "herbivorous",
    "whenLived": "Late Cretaceous, 72-67 million years ago",
    "foundIn": "Canada",
    "taxonomy": "Dinosauria, Ornithischia, Neornithischia, Cerapoda, Marginocephalia, Ceratopsia, Neoceratopsia, Coronosauria, Ceratopsidae, Chasmosaurinae",
    "namedBy": "Parks (1925)",
    "typeSpecies": "brachyops",
    "description": "Arrhinoceratops, a ceratopsian dinosaur from the Late Cretaceous period, lacked a nasal horn, distinguishing it from other members of its group. Known primarily from a partial skull found in Alberta, Canada, it provides valuable insights into ceratopsian diversity and evolution."
},
{
  "id": 33,
  "name": "Atlascopcosaurus",
  "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/Atlascopcosaurus.jpg",
  "typeOfDinosaur": "small ornithopod",
  "length": 3,
  "weight": 150,
  "diet": "herbivorous",
  "whenLived": "Early Cretaceous, 121-97 million years ago",
  "foundIn": "Australia",
  "taxonomy": "Dinosauria, Ornithischia, Ornithopoda, Euornithopoda",
  "namedBy": "Rich and Rich (1989)",
  "typeSpecies": "loadsi",
  "description": "Atlascopcosaurus was a small herbivorous dinosaur that lived during the Early Cretaceous period, approximately 121 to 97 million years ago. It belonged to the group of dinosaurs known as ornithopods and was discovered in Australia. Although its weight is estimated to be around 150 kilograms, it had a relatively small size, with a length of about 3 meters. The species was named Atlascopcosaurus loadsi by Rich and Rich in 1989. Despite being classified as a small dinosaur, Atlascopcosaurus played an important role in its ecosystem as a herbivore, likely feeding on plants and vegetation available in its environment."
},
  {
    "id": 34,
    "name": "Aucasaurus",
    "imageSrc": "N/A",
    "typeOfDinosaur": "large theropod",
    "length": 5,
    "weight": 1000,
    "diet": "carnivorous",
    "whenLived": "Late Cretaceous, 84-71 million years ago",
    "foundIn": "Argentina",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Neotheropoda, Ceratosauria, Neoceratosauria, Abelisauroidea, Abelisauria",
    "namedBy": "Coria, Chiappe and Dingus (2002)",
    "typeSpecies": "garridoi",
    "description": "Aucasaurus, a large theropod dinosaur, lived during the Late Cretaceous period, approximately 84 to 71 million years ago, in what is now Argentina. Belonging to the group Abelisauria, it thrived in the ancient landscapes of South America. Named by Coria, Chiappe, and Dingus in 2002, Aucasaurus is known from an almost complete skeleton, providing valuable insights into its anatomy and behavior. While its weight is unspecified, its length of around 5 meters suggests a formidable predator. Aucasaurus was carnivorous, likely preying on smaller dinosaurs and other fauna of its time. Its classification within the theropod lineage sheds light on the diverse array of carnivorous dinosaurs that inhabited prehistoric ecosystems."
  },
  {
    "id": 35,
    "name": "Austrosaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/Austrosaurus.jpg",
    "typeOfDinosaur": "sauropod",
    "length": 15,
    "weight": 13200,
    "diet": "herbivorous",
    "whenLived": "Early Cretaceous, 112-99 million years ago",
    "foundIn": "Australia",
    "taxonomy": "Dinosauria, Saurischia, Sauropodomorpha, Sauropoda, Eusauropoda, Neosauropoda, Macronaria, Camarasauromorpha, Titanosauriformes, Titanosauria",
    "namedBy": "Longman (1933)",
    "typeSpecies": "mckillopi",
    "description": "Dorsal vertebrae (part of the backbone) and limb remains of Austrosaurus have been found."
  },
  {
    "id": 36,
    "name": "Avaceratops",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/Avaceratops.jpg",
    "typeOfDinosaur": "ceratopsian",
    "length": 2.3,
    "weight": 1000,
    "diet": "herbivorous",
    "whenLived": "Late Cretaceous, 80-75 million years ago",
    "foundIn": "USA",
    "taxonomy": "Dinosauria, Ornithischia, Neornithischia, Cerapoda, Marginocephalia, Ceratopsia, Neoceratopsia, Coronosauria, Ceratopsidae, Centrosaurinae",
    "namedBy": "Dodson (1986)",
    "typeSpecies": "lammersi",
    "description": "Avaceratops was a ceratopsian dinosaur that lived during the Late Cretaceous period, approximately 80 to 75 million years ago, in what is now the USA. Belonging to the subfamily Centrosaurinae within the Ceratopsidae family, Avaceratops is known from fragmentary remains. Despite the limited fossil evidence, it is estimated to have been a small to medium-sized herbivore. The specific weight of Avaceratops is unknown, but it likely ranged within the typical weight range for ceratopsians of its size."
  },
  {
    "id": 37,
    "name": "Avimimus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/avim.jpg",
    "typeOfDinosaur": "small theropod",
    "length": 1.5,
    "weight": 11,
    "diet": "omnivorous",
    "whenLived": "Late Cretaceous, 80-75 million years ago",
    "foundIn": "China, Mongolia",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Neotheropoda, Tetanurae, Avetheropoda, Coelurosauria, Tyrannoraptora, Maniraptoriformes, Maniraptora, Oviraptorosauria, Avimimidae",
    "namedBy": "Kurzanov (1981)",
    "typeSpecies": "portentosus",
    "description": "Avimimus was a small omnivorous dinosaur that lived during the Late Cretaceous period, approximately 80 to 75 million years ago, in what is now China and Mongolia. Classified as a member of the Oviraptorosauria group, Avimimus is known for its bird-like appearance and unique adaptations. Despite its small size, Avimimus likely played a significant role in its ecosystem as an omnivore, feeding on a variety of plants, small animals, and possibly insects. The specific weight of Avimimus is unknown due to limited fossil evidence."
  },
  {
    "id": 38,
    "name": "Bactrosaurus",
    "imageSrc": "N/A",
    "typeOfDinosaur": "large ornithopod",
    "length": 6,
    "weight": 1400,
    "diet": "herbivorous",
    "whenLived": "Late Cretaceous, 84-71 million years ago",
    "foundIn": "China",
    "taxonomy": "Dinosauria, Ornithischia, Ornithopoda, Hadrosauridae",
    "namedBy": "Gilmore (1933)",
    "typeSpecies": "johnsoni",
    "description": "Bactrosaurus was a large herbivorous dinosaur that lived during the Late Cretaceous period, approximately 84 to 71 million years ago, in what is now China. Belonging to the Hadrosauridae family, Bactrosaurus is known from skull fragments and postcranial bones of at least 12 individuals, ranging from juveniles to adults. Despite its large size, the specific weight of Bactrosaurus is unknown due to the incomplete nature of the fossil record. Bactrosaurus likely played a significant role in its ecosystem as a herbivore, feeding on vegetation and plants available in its habitat."
  },
  {
    "id": 39,
    "name": "Bagaceratops",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/Bagaceratops.jpg",
    "typeOfDinosaur": "ceratopsian",
    "length": 1,
    "weight": 140,
    "diet": "herbivorous",
    "whenLived": "Late Cretaceous, 85-80 million years ago",
    "foundIn": "Mongolia",
    "taxonomy": "Dinosauria, Ornithischia, Neornithischia, Cerapoda, Marginocephalia, Ceratopsia, Neoceratopsia, Bagaceratopsidae",
    "namedBy": "Maryanska and Osmolska (1975)",
    "typeSpecies": "rozhdestvenskyi",
    "description": "Bagaceratops, a ceratopsian dinosaur, lived during the Late Cretaceous period, approximately 85 to 80 million years ago in what is now Mongolia. Belonging to the family Bagaceratopsidae, Bagaceratops is known from incomplete fossils, making it challenging to determine its exact weight. It is estimated to have been a relatively small ceratopsian, likely similar in size to other small ceratopsians. Further research may provide more insights into the morphology and characteristics of Bagaceratops."
  },
  {
    "id": 40,
    "name": "Bambiraptor",
    "imageSrc": "N/A",
    "typeOfDinosaur": "small theropod",
    "length": 1,
    "weight": 16,
    "diet": "carnivorous",
    "whenLived": "Late Cretaceous, 84-71 million years ago",
    "foundIn": "USA",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Dromaeosauridae",
    "namedBy": "Burnham, Derstler, Currie, Bakker, Zhou and Ostrom (2000)",
    "typeSpecies": "feinbergorum",
    "description": "Bambiraptor was a small theropod dinosaur that lived during the Late Cretaceous period, approximately 84 to 71 million years ago in what is now the USA. Despite its small size, Bambiraptor was a carnivorous predator, likely preying on smaller vertebrates and possibly insects. Due to the lack of specific fossil evidence, the weight of Bambiraptor remains unknown. Further discoveries and research may provide more insights into the biology and behavior of this fascinating dinosaur."
  },
  {
    "id": 41,
    "name": "Barapasaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/barapa.jpg",
    "typeOfDinosaur": "sauropod",
    "length": 14,
    "weight": 8500,
    "diet": "herbivorous",
    "whenLived": "Early Jurassic, 185-170 million years ago",
    "foundIn": "India",
    "taxonomy": "Dinosauria, Saurischia, Sauropodomorpha, Sauropoda, Eusauropoda, Cetiosauridae",
    "namedBy": "Jain, Kutty, Roy-Chowdhury and Chatterjee (1975)",
    "typeSpecies": "tagorei",
    "description": "Barapasaurus, a sauropod dinosaur, lived during the Early Jurassic period, approximately 185 to 170 million years ago in what is now India. It was a primitive but very large sauropod, although specific details about its weight are currently unknown. Barapasaurus belonged to the taxonomic group Cetiosauridae and was named by Jain, Kutty, Roy-Chowdhury, and Chatterjee in 1975. The type species of Barapasaurus is tagorei."
  },
  {
    "id": 42,
    "name": "Barosaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/baro.jpg",
    "typeOfDinosaur": "sauropod",
    "length": 24,
    "weight": 6000,
    "diet": "herbivorous",
    "whenLived": "Late Jurassic, 155-145 million years ago",
    "foundIn": "Tanzania, USA",
    "taxonomy": "Dinosauria, Saurischia, Sauropodomorpha, Sauropoda, Eusauropoda, Neosauropoda, Diplodocoidea, Diplodocidae",
    "namedBy": "Marsh (1890)",
    "typeSpecies": "lentus",
    "description": "Barosaurus was a sauropod dinosaur that lived during the Late Jurassic period, approximately 155 to 145 million years ago in what is now Tanzania and the USA. Although it was a large herbivorous dinosaur, specific details about its weight are currently unknown. Barosaurus belonged to the taxonomic group Diplodocidae and was named by Marsh in 1890. The type species of Barosaurus is lentus."
  },
  {
    "id": 43,
    "name": "Baryonyx",
    "imageSrc": "N/A",
    "typeOfDinosaur": "large theropod",
    "length": 10,
    "weight": 2000,
    "diet": "carnivorous",
    "whenLived": "Early Cretaceous, 125 million years ago",
    "foundIn": "England, Spain, United Kingdom",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Spinosauridae, Baryonychinae",
    "namedBy": "Charig and Milner (1987)",
    "typeSpecies": "walkeri",
    "description": "The mouth shape of this dinosaur was very similar to that of a crocodile, and it had a large claw, about 31cm long, probably on its thumb. Baryonyx may have crouched on river banks or waded into shallow water to hook fish with its claws. It was also a scavenger."
  },
  {
    "id": 44,
    "name": "Becklespinax",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/Becklespinax.jpg",
    "typeOfDinosaur": "large theropod",
    "length": 5,
    "weight": "N/A",
    "diet": "carnivorous",
    "whenLived": "Early Cretaceous, 142-132 million years ago",
    "foundIn": "England, United Kingdom",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Neotheropoda, Tetanurae",
    "namedBy": "Paul (1988)",
    "typeSpecies": "altispinax",
    "description": "N/A"
  },
  {
    "id": 45,
    "name": "Beipiaosaurus",
    "imageSrc": "N/A",
    "typeOfDinosaur": "small theropod",
    "length": 2,
    "weight": 43,
    "diet": "omnivorous",
    "whenLived": "Early Cretaceous, 127-121 million years ago",
    "foundIn": "China",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Neotheropoda, Tetanurae, Avetheropoda, Coelurosauria, Tyrannoraptora, Maniraptoriformes, Maniraptora, Therizinosauroidea",
    "namedBy": "Xu, Tang and Wang (1999)",
    "typeSpecies": "inexpectus",
    "description": "Beipiaosaurus, a small theropod dinosaur, inhabited the ancient landscapes of China during the Early Cretaceous period, approximately 127 to 121 million years ago. Although its weight is not specified, its length is estimated to be around 2 meters. Belonging to the group Therizinosauroidea, Beipiaosaurus was an omnivorous dinosaur, likely feeding on a variety of plants and small prey. Its fossils were named by Xu, Tang, and Wang in 1999, and the type species is Beipiaosaurus inexpectus."
  },
  {
    "id": 46,
    "name": "Bellusaurus",
    "imageSrc": "N/A",
    "typeOfDinosaur": "sauropod",
    "length": 5,
    "weight": 450,
    "diet": "herbivorous",
    "whenLived": "Mid Jurassic, 180-159 million years ago",
    "foundIn": "China",
    "taxonomy": "Dinosauria, Saurischia, Sauropodomorpha, Sauropoda, Eusauropoda, Neosauropoda, Macronaria",
    "namedBy": "Dong and Azuma (1990)",
    "typeSpecies": "sui",
    "description": "Bellusaurus, a sauropod dinosaur, roamed the ancient lands of China during the Mid Jurassic period, approximately 180 to 159 million years ago. While its weight is not specified, it had a length of about 5 meters. As a herbivorous dinosaur, Bellusaurus likely fed on vegetation, utilizing its long neck to reach high branches. Its fossils, consisting of 17 partial skeletons, including individuals of varying ages, were named by Dong and Azuma in 1990. The type species of Bellusaurus is Bellusaurus sui."
  },
  {
    "id": 47,
    "name": "Borogovia",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/Borogovia.jpg",
    "typeOfDinosaur": "small theropod",
    "length": 1.5,
    "weight": 18,
    "diet": "carnivorous",
    "whenLived": "Late Cretaceous, 84-66 million years ago",
    "foundIn": "Mongolia",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Paraves, Eumaniraptoria, Troodontidae",
    "namedBy": "OsmÃ³lska (1987)",
    "typeSpecies": "gracilicrus",
    "description": "Only partial hindlimbs of this dinosaur have been found, so reconstructions are speculative. It was named after Lewis Carroll's borogoves from the poem Jabberwocky, published in 1871."
  },
  {
    "id": 48,
    "name": "Brachiosaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/brach.jpg",
    "typeOfDinosaur": "sauropod",
    "length": 30,
    "weight": 17000,
    "diet": "herbivorous",
    "whenLived": "Late Jurassic, 155-140 million years ago",
    "foundIn": "Algeria, Portugal, Tanzania, USA",
    "taxonomy": "Dinosauria, Saurischia, Sauropodomorpha, Sauropoda, Eusauropoda, Neosauropoda, Macronaria, Camarasauromorpha, Titanosauriformes, Brachiosauridae",
    "namedBy": "Riggs (1903)",
    "typeSpecies": "altithorax",
    "description": "Brachiosaurus held its head very high. It is likely to have eaten the leaves on tall tree-like plants."
  },
  {
    "id": 49,
    "name": "Brachylophosaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/Brachylophosaurus.jpg",
    "typeOfDinosaur": "large ornithopod",
    "length": 7,
    "weight": 4200,
    "diet": "herbivorous",
    "whenLived": "Late Cretaceous, 89-88 million years ago",
    "foundIn": "Canada, USA",
    "taxonomy": "Dinosauria, Ornithischia, Ornithopoda, Hadrosauridae, Euhadrosauria, Hadrosaurinae",
    "namedBy": "C. M. Sternberg (1953)",
    "typeSpecies": "canadensis",
    "description": "Brachylophosaurus, a genus of hadrosaurid dinosaur, inhabited North America during the Late Cretaceous period, approximately 80 million years ago. This herbivorous dinosaur roamed the ancient landscapes of what is now Montana, USA, and Alberta, Canada. Named by Charles M. Sternberg in 1953, Brachylophosaurus is characterized by its distinctive crest, which resembled a hatchet or paddle. These crests likely played a role in communication and species recognition, as well as thermoregulation. Brachylophosaurus grew to lengths of around 9 meters and weighed several tons. Fossil discoveries have provided valuable insights into its behavior, diet, and evolutionary adaptations."
  },
  {
    "id": 50,
    "name": "Brachytrachelopan",
    "imageSrc": "N/A",
    "typeOfDinosaur": "sauropod",
    "length": 10,
    "weight": 3000,
    "diet": "herbivorous",
    "whenLived": "Mid Jurassic, 150 million years ago",
    "foundIn": "Argentina",
    "taxonomy": "Dinosauria, Saurischia, Sauropodomorpha, Sauropoda, Eusauropoda, Neosauropoda, Diplodocoidea, Dicraeosauridae",
    "namedBy": "Rauhut, Remes, Fechner, Cladera and Puerta (2005)",
    "typeSpecies": "mesai",
    "description": "Brachytrachelopan is known from partial neck and dorsal vertebrae (part of the backbone), ribs, a partial pelvis and limb bones. This dinosaur had, proportionately, the shortest neck of any known sauropod."
  },
  {
    "id": 51,
    "name": "Buitreraptor",
    "imageSrc": "N/A",
    "typeOfDinosaur": "small theropod",
    "length": 1.3,
    "weight": 5.5,
    "diet": "carnivorous",
    "whenLived": "Late Cretaceous, 99-90 million years ago",
    "foundIn": "Argentina",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Dromaeosauridae, Unenlagiinae",
    "namedBy": "Makovicky, ApesteguÃ­a & Agnolin (2005)",
    "typeSpecies": "gonzalezorum",
    "description": "Buitreraptor, a small theropod dinosaur from the Late Cretaceous era, roamed Argentina about 90 million years ago. With its bird-like features and agile build, it likely hunted prey with its sharp claws. This discovery offers important clues about dinosaur evolution and the origins of flight."
  },
  {
    "id": 53,
    "name": "Camptosaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/campto.jpg",
    "typeOfDinosaur": "large ornithopod",
    "length": 5,
    "weight": 1000,
    "diet": "herbivorous",
    "whenLived": "Late Jurassic, 155-145 million years ago",
    "foundIn": "England, United Kingdom, USA",
    "taxonomy": "Dinosauria, Ornithischia, Ornithopoda, Euornithopoda, Iguanadontia, Euiguanadontia, Dryomorpha, Ankylopollexia",
    "namedBy": "Marsh (1885)",
    "typeSpecies": "dispar",
    "description": "Camptosaurus, a herbivorous dinosaur from the Late Jurassic period, inhabited Endgland and North America around 155 million years ago. It was characterized by its robust body, long tail, and beak-like snout adapted for cropping vegetation. This dinosaur played a significant role in the ecosystems of its time as a primary herbivore."
  },
  {
    "id": 54,
    "name": "Carcharodontosaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/carcharodontosaurus.jpg",
    "typeOfDinosaur": "large theropod",
    "length": 12.5,
    "weight": 3900,
    "diet": "carnivorous",
    "whenLived": "Late Cretaceous, 99-94 million years ago",
    "foundIn": "Algeria, Egypt, Morocco, North Africa",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Carcharodontosauridae",
    "namedBy": "Stromer (1931)",
    "typeSpecies": "saharicus",
    "description": "Carcharodontosaurus was a very large meat-eating dinosaur.It is named after Carcharodon, the scientific name for several types of shark - of which the great white shark is the only living example.Carcharodontosaurus teeth look a lot like shark teeth. Like Tyrannosaurus, it had about 60 of them.Carcharodontosaurus fossils have been found across North Africa in Algeria, Egypt and Morocco.In the Late Cretaceous, this region was warm and humid with rainforests, rivers and lakes.Carcharodontosaurus lived alongside many other dinosaurs, including sauropods such as Paralititan and Rebbachisaurus and the theropods Spinosaurus and Deltadromeus.Scientists aren't sure what Carcharodontosaurus ate. It most likely fed on large prey such as plant-eating dinosaurs.Carcharodontosaurus had a much less powerful bite than Tyrannosaurus and more fragile teeth. But while it probably didn't crush bones, its teeth were suited to ripping flesh.Carcharodontosaurus is one of the largest carnivorous dinosaurs known. At one point, scientists thought its skull might be the longest ever found. It was around 1.6 metres in length.The full animal could reach lengths of at least 12.5 metres - a size comparable to Tyrannosaurus.Giganotosaurus may have been even larger than both dinosaurs. A lack of complete remains makes it hard to be sure.Carcharodontosaurus was a close relative of Giganotosaurus.Both dinosaurs are carcharodontosaurs - a group that also contains several other interesting dinosaurs, such as the peculiar-looking Concavenator and the British theropod Neovenator.Yet Carcharodontosaurus and Giganotosaurus didn't live in the same place. Giganotosaurus is found in South America.The close relation of these two dinosaurs may be because Africa and South America were once connected. They broke apart during the Cretaceous Period. Scientists are still debating exactly when the separation occurred."
  },
  {
    "id": 55,
    "name": "Carnotaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/carnotaurus.jpg",
    "typeOfDinosaur": "large theropod",
    "length": 8,
    "weight": 1850,
    "diet": "carnivorous",
    "whenLived": "Late Cretaceous, 69-71 million years ago",
    "foundIn": "Argentina",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Neotheropoda, Ceratosauria, Abelisauridae",
    "namedBy": "Bonaparte (1985)",
    "typeSpecies": "sastrei",
    "description": "Carnotaurus was a meat-eating dinosaur with two horns on the top of its head and very small arms.It had an unusually short snout and its head was very narrow when viewed from the front.Scientists have found lots of skin impressions for this dinosaur, so we know that it had scales over much of its body. It's unlikely that Carnotaurus or its relatives had feathers - no evidence of them has ever been found.We also don't have a complete skeleton. So far, nobody has ever found the tail or lower legs of Carnotaurus. This means we must use some guesswork based on the remains of this dinosaur's close relatives to do a full-body reconstruction.Nobody is quite sure what Carnotaurus' horns were for. Some experts think the dinosaur might have used them to fight rivals or attack prey.Another idea is that the horns might have helped to attract a mate or identify other Carnotaurus.Experts believe that Carnotaurus' ancestors would have had longer arms. Over time the arms got smaller and less useful.Carnotaurus probably didn't use its arms for much. They were a leftover trait from the dinosaur's earlier ancestors.Scientists call this a vestigial feature. It comes from the word 'vestige', meaning 'a small trace of something that existed a long time ago'.Many animals have vestigial features, including humans. For example, you still have a tailbone in your skeleton, even though you don't have a tail!In his novel The Lost World - the sequel to Jurassic Park - Michael Crichton described Carnotaurus as able to disguise itself with changing skin colours, like a chameleon.We don't have evidence that any dinosaur ever had this ability. If they did, we wouldn't be able to tell from fossil remains.It's always possible that any given dinosaur might have had an unusual or surprising feature that isn't shown in fossils. Fiction is a great place to explore interesting ideas.Although Carnotaurus looked unusual with its tiny arms and short snout, it wasn't the only dinosaur like this.Carnotaurus was part of the abelisaur group. These closely related dinosaurs shared similar characteristics. But Carnotaurus is the only one known to have two horns on its head.Other abelisaurs include Abelisaurus itself, Majungasaurus and the Indian predator Rajasaurus.Carnotaurus and Tyrannosaurus weren't very closely related.The two dinosaurs do share some similarities - both are meat-eating dinosaurs that walked on two legs. But they are also quite different.Tyrannosaurs had more powerful jaws and teeth than abelisaurs, as well as longer arms with two-fingered hands. Abelisaurs had four fingers on each hand. Tyrannosaurs could also grow much larger.Carnotaurus and Tyrannosaurus belong to two different dinosaur groups - ceratosaurs and coelurosaurs. These groups might have been evolving apart for more than 100 million years, since the Late Triassic Period.Carnotaurus fossils have only been found in Argentina. They occur in Late Cretaceous rocks that may have formed from the deposits of estuaries or tidal flats.We know Carnotaurus shared its environment with other dinosaurs. Researchers have found partial remains of as-yet unnamed ankylosaurs and hadrosaurs in the same area, but we don't know exactly what these dinosaurs were like.Although it was clearly a meat-eater, nobody knows for sure what types of animals Carnotaurus hunted.Many experts think it probably preyed on large sauropod dinosaurs. Teeth belonging to related abelisaurs have been found with sauropod remains, so it seems likely.Carnotaurus had a more flexible lower jaw than most other carnivorous dinosaurs. It may have been able to open its jaw wide, like a snake, to swallow big chunks of meat.Originally, researchers thought that the flexible jaw meant Carnotaurus didn't have a very strong bite. But more recent studies contradict this. Some experts think Carnotaurus may even have had a stronger bite force than an American alligator, the most powerful biting creature alive today.When you're talking about more than one dinosaur of a particular kind, you don't need to put an 's' on the end.You can think of it the same way as you would say 'two sheep'.This applies to all dinosaur names - so you can say 'two Carnotaurus' or 'five Velociraptor'."
  },
  {
    "id": 56,
    "name": "Caudipteryx",
    "imageSrc": "N/A",
    "typeOfDinosaur": "small theropod",
    "length": 1,
    "weight": 2,
    "diet": "omnivorous",
    "whenLived": "Early Cretaceous, 125-122 million years ago",
    "foundIn": "China",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Neotheropoda, Tetanurae, Avetheropoda, Coelurosauria, Tyrannoraptora, Maniraptoriformes, Maniraptora, Oviraptorosauria, Caudipterygidae",
    "namedBy": "Ji, Currie, Norell and Ji. (1998)",
    "typeSpecies": "zoui",
    "description": "This bird-like dinosaur lived after Archaeopteryx. It had a fan of feathers at the end of its tail.Caudipteryx has been found with gizzard stones (small stones swallowed by the dinosaur, perhaps to help digest food) and had small, weak teeth. It probably ate insects and maybe plants as well."
  },
  {
    "id": 57,
    "name": "Cedarpelta",
    "imageSrc": "N/A",
    "typeOfDinosaur": "armoured dinosaur",
    "length": 10,
    "weight": 4000,
    "diet": "herbivorous",
    "whenLived": "Early Cretaceous, 142-127 million years ago",
    "foundIn": "USA",
    "taxonomy": "Dinosauria, Ornithischia, Thyreophora, Ankylosauria, Ankylosauridae",
    "namedBy": "Carpenter, Kirkland, Burge and Bird (2001)",
    "typeSpecies": "bilbeyhallorum",
    "description": "Cedarpelta, a herbivorous dinosaur, inhabited the Earth during the Early Cretaceous period, around 125 million years ago. Known for its unique armor plating, Cedarpelta likely used its defensive features against predators. This dinosaur, discovered in North America, adds to our understanding of the diverse herbivorous species that roamed the ancient landscapes. A skull and partial skeleton of this dinosaur have been found."
  },
  {
    "id": 58,
    "name": "Centrosaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/centro.jpg",
    "typeOfDinosaur": "ceratopsian",
    "length": 6,
    "weight": 1000,
    "diet": "herbivorous",
    "whenLived": "Late Cretaceous, 76-74 million years ago",
    "foundIn": "Canada",
    "taxonomy": "Dinosauria, Ornithischia, Neornithischia, Cerapoda, Marginocephalia, Ceratopsia, Neoceratopsia, Coronosauria, Ceratopsidae, Centrosaurinae",
    "namedBy": "N/A",
    "typeSpecies": "apertus",
    "description": "Centrosaurus had one horn on its snout and spines around the back of its neck frill."
  },
  {
    "id": 60,
    "name": "Cetiosauriscus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/cetios.jpg",
    "typeOfDinosaur": "sauropod",
    "length": 15,
    "weight": 11000,
    "diet": "herbivorous",
    "whenLived": "Mid Jurassic, 175-160 million years ago",
    "foundIn": "England, United Kingdom",
    "taxonomy": "Dinosauria, Saurischia, Sauropodomorpha, Sauropoda, Eusauropoda, Neosauropoda, Diplodocoidea",
    "namedBy": "von Huene (1927)",
    "typeSpecies": "stewarti",
    "description": "Cetiosauriscus, a sauropod dinosaur, lived during the Jurassic period, around 168 million years ago. With its long neck and massive body, it roamed the ancient landscapes, feeding on vegetation. Fossils of Cetiosauriscus have been found in England, providing valuable insights into the diversity of Jurassic-era dinosaurs."
  },
  {
    "id": 61,
    "name": "Cetiosaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/cetio.jpg",
    "typeOfDinosaur": "sauropod",
    "length": 18,
    "weight": 11000,
    "diet": "herbivorous",
    "whenLived": "Mid Jurassic, 170-160 million years ago",
    "foundIn": "England, United Kingdom",
    "taxonomy": "Dinosauria, Saurischia, Sauropodomorpha, Sauropoda, Eusauropoda, Cetiosauridae",
    "namedBy": "Phillips (1871)",
    "typeSpecies": "oxoniensis",
    "description": "Cetiosaurus, a sauropod dinosaur from the Jurassic period, inhabited Earth around 168 million years ago. Recognized for its long neck and colossal size, it was a herbivore that grazed on plants. Fossils of Cetiosaurus have been discovered in Europe, contributing to our understanding of prehistoric biodiversity."
  },
  {
    "id": 62,
    "name": "Chaoyangsaurus",
    "imageSrc": "N/A",
    "typeOfDinosaur": "ceratopsian",
    "length": 1.1,
    "weight": 6,
    "diet": "herbivorous",
    "whenLived": "Late Jurassic, 152-145 million years ago",
    "foundIn": "China",
    "taxonomy": "Dinosauria, Ornithischia, Neornithischia, Cerapoda, Marginocephalia, Ceratopsia, Neoceratopsia",
    "namedBy": "Zhao, Cheng and Xu (1999)",
    "typeSpecies": "youngi",
    "description": "Chaoyangsaurus is the earliest known ceratopsian (shield dinosaur)."
  },
  {
    "id": 63,
    "name": "Chasmosaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/chasmo.jpg",
    "typeOfDinosaur": "ceratopsian",
    "length": 5,
    "weight": 2500,
    "diet": "herbivorous",
    "whenLived": "Late Cretaceous, 76-74 million years ago",
    "foundIn": "Canada",
    "taxonomy": "Dinosauria, Ornithischia, Neornithischia, Cerapoda, Marginocephalia, Ceratopsia, Neoceratopsia, Coronosauria, Ceratopsidae, Chasmosaurinae",
    "namedBy": "N/A",
    "typeSpecies": "belli",
    "description": "Chasmosaurus had a small nose horn, blunt brow horns and a long neck frill with holes."
  },
  {
    "id": 64,
    "name": "Chindesaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/Chindesaurus.jpg",
    "typeOfDinosaur": "early dinosaur",
    "length": 4,
    "weight": 19,
    "diet": "carnivorous",
    "whenLived": "Late Triassic, 227-210 million years ago",
    "foundIn": "USA",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Herrerasauridae",
    "namedBy": "Long and Murry (1995)",
    "typeSpecies": "bryansmalli",
    "description": "Chindesaurus had a long whip-like tail and long legs. No skull has been found, so its reconstruction is guesswork based on similar dinosaurs."
  },
  {
    "id": 65,
    "name": "Chinshakiangosaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/Chinshakiangosaurus.jpg",
    "typeOfDinosaur": "sauropod",
    "length": 11,
    "weight": 2750,
    "diet": "herbivorous",
    "whenLived": "Late Jurassic, 159-142 million years ago",
    "foundIn": "China",
    "taxonomy": "Dinosauria, Saurischia, Sauropodomorpha, Sauropoda",
    "namedBy": "Yeh (1975)",
    "typeSpecies": "zhongheensis",
    "description": "Chinshakiangosaurus is only known from a fragmentary skeleton."
  },
  {
    "id": 66,
    "name": "Chirostenotes",
    "imageSrc": "N/A",
    "typeOfDinosaur": "small theropod",
    "length": 1.7,
    "weight": 40,
    "diet": "omnivorous",
    "whenLived": "Late Jurassic, 79-67 million years ago",
    "foundIn": "Canada",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Neotheropoda, Tetanurae, Avetheropoda, Coelurosauria, Tyrannoraptora, Maniraptoriformes, Maniraptora, Oviraptorosauria, Caenagnathoidea, Caenagnathidae",
    "namedBy": "Gilmore (1924)",
    "typeSpecies": "pergracilis",
    "description": "Chirostenotes was a small theropod dinosaur characterized by its long arms and distinctive hand claws. Believed to have been omnivorous, this dinosaur lived during the Late Jurrasic period."
  },
  {
    "id": 67,
    "name": "Chubutisaurus",
    "imageSrc": "N/A",
    "typeOfDinosaur": "sauropod",
    "length": 23,
    "weight": 14000,
    "diet": "herbivorous",
    "whenLived": "Early Cretaceous, 112-99 million years ago",
    "foundIn": "Argentina",
    "taxonomy": "Dinosauria, Saurischia, Sauropodomorpha, Sauropoda, Eusauropoda, Neosauropoda, Macronaria, Camarasauromorpha, Titanosauriformes, Titanosauria",
    "namedBy": "Corro (1974)",
    "typeSpecies": "insignis",
    "description": "Chubutisaurus was a large herbivorous dinosaur that lived during the Late Cretaceous period. It belonged to the sauropod group and is known for its long neck and tail, as well as its massive body."
  },
  {
    "id": 68,
    "name": "Chungkingosaurus",
    "imageSrc": "N/A",
    "typeOfDinosaur": "armoured dinosaur",
    "length": 4,
    "weight": 900,
    "diet": "herbivorous",
    "whenLived": "Late Jurassic, 159-142 million years ago",
    "foundIn": "China",
    "taxonomy": "Dinosauria, Ornithischia, Thyreophora, Stegosauria, Stegosauridae, Stegosaurinae",
    "namedBy": "Dong, Zhou and Zhang (1983)",
    "typeSpecies": "jiangbeiensis",
    "description": "Chungkingosaurus was a herbivorous dinosaur that lived during the Late Jurassic period. It was characterized by its armor-plated body, with rows of bony plates along its back, and a heavy clubbed tail for defense against predators. This dinosaur is known from a partial skull and a partial skeleton."
  },
  {
    "id": 69,
    "name": "Citipati",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/Citipati.jpg",
    "typeOfDinosaur": "small theropod",
    "length": 2.1,
    "weight": 80,
    "diet": "omnivorous",
    "whenLived": "Late Cretaceous, 81-75 million years ago",
    "foundIn": "Mongolia",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Neotheropoda, Tetanurae, Avetheropoda, Coelurosauria, Tyrannoraptora, Maniraptoriformes, Maniraptora, Oviraptorosauria, Caenagnathoidea, Oviraptoridae, Oviraptorinae",
    "namedBy": "Clark, Norell and Barsbold (2001)",
    "typeSpecies": "osmolskae",
    "description": "Citipati was a small theropod dinosaur from the Late Cretaceous period. It belonged to the group of oviraptorosaurs and is known for its distinct crested skull. Fossils of Citipati have been found in Mongolia, and it is believed to have been omnivorous, feeding on both plants and small animals."
  },
  {
    "id": 70,
    "name": "Coelophysis",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/coelo.jpg",
    "typeOfDinosaur": "small theropod",
    "length": 2,
    "weight": 27,
    "diet": "carnivorous",
    "whenLived": "Late Triassic, 225-190 million years ago",
    "foundIn": "South Africa, USA, Zimbabwe",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Neotheropoda, Coelophysoidea, Coelophysidae",
    "namedBy": "N/A",
    "typeSpecies": "bauri",
    "description": "In the Late Triassic Period dinosaurs were not at the top of the food chain. Instead, early large reptiles called phytosaurs and rauisuchids domintated.Early meat-eating dinosaurs like Coelophysis relied on their speed and agility to catch a variety of animals like insects and small reptiles. The sharp teeth and grasping claws of Coelophysis would have helped them to hold and kill their food.A fossil find of an adult skeleton with what appeared to be young Coelophysis bones inside its rib cage led scientists to speculate that Coelophysis ate each other when the opportunity arose.Recent analysis has disproved this, however, by showing that the bones inside the ribcage are not a baby Coelophysis after all, but belong to a small crocodile.Coelophysis means 'hollow form' and this comes from the hollow limb bones. This feature was shared by many other dinosaurs, and would have given Coelophysis a lightly-built body, helping it to be a swift, agile hunter."
  },
  {
    "id": 71,
    "name": "Coelurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/coelurus.jpg",
    "typeOfDinosaur": "small theropod",
    "length": 1.8,
    "weight": 20,
    "diet": "carnivorous",
    "whenLived": "Late Jurassic, 155-145 million years ago",
    "foundIn": "USA",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Neotheropoda, Tetanurae, Avetheropoda, Coelurosauria",
    "namedBy": "Marsh (1879)",
    "typeSpecies": "fragilis",
    "description": "Coelurus was a small, agile theropod dinosaur from the Late Jurassic period. It had long legs and a slender body, suggesting it was a fast runner. Fossils of Coelurus have been found in North America."
  },
  {
    "id": 72,
    "name": "Coloradisaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/Coloradisaurus.jpg",
    "typeOfDinosaur": "prosauropod",
    "length": 4,
    "weight": 600,
    "diet": "omnivorous",
    "whenLived": "Late Triassic, 221-210 million years ago",
    "foundIn": "Argentina",
    "taxonomy": "Dinosauria, Saurischia, Sauropodomorpha, Prosauropoda, Plateosauria, Plateosauridae",
    "namedBy": "Bonaparte (1978)",
    "typeSpecies": "brevis",
    "description": "Coloradisaurus, an early sauropodomorph dinosaur, roamed the Earth during the Late Triassic period. It was characterized by its small size, reaching around 2-4 meters in length. Fossil remains of Coloradisaurus have been found in what is now Argentina."
  },
  {
    "id": 73,
    "name": "Compsognathus",
    "imageSrc": "N/A",
    "typeOfDinosaur": "small theropod",
    "length": 0.65,
    "weight": 3,
    "diet": "carnivorous",
    "whenLived": "Late Jurassic, 145-140 million years ago",
    "foundIn": "France, Germany",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Neotheropoda, Tetanurae, Avetheropoda, Coelurosauria, Compsognathidae",
    "namedBy": "Wagner (1859)",
    "typeSpecies": "longipes",
    "description": "Compsognathus, a small theropod dinosaur, inhabited Europe during the Late Jurassic period. It was one of the smallest known dinosaurs, measuring about 1 meter in length. Fossils of Compsognathus have been found in Germany and France."
  },
  {
    "id": 74,
    "name": "Conchoraptor",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/Conchoraptor.jpg",
    "typeOfDinosaur": "small theropod",
    "length": 1.5,
    "weight": 32,
    "diet": "carnivorous",
    "whenLived": "Late Cretaceous, 81-76 million years ago",
    "foundIn": "Mongolia",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Neotheropoda, Tetanurae, Avetheropoda, Coelurosauria, Tyrannoraptora, Maniraptoriformes, Maniraptora, Oviraptorosauria, Caenagnathoidea, Oviraptoridae, Ingeniinae",
    "namedBy": "Barsbold (1986)",
    "typeSpecies": "gracilis",
    "description": "Remains of this dinosaur have been found with feathers preserved. Sexual differences can be seen in the plumage."
  },
  {
    "id": 75,
    "name": "Confuciusornis",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/Confuciusornis.jpg",
    "typeOfDinosaur": "small theropod",
    "length": 0.25,
    "weight": 0.5,
    "diet": "carnivorous",
    "whenLived": "Early Cretaceous, 127-121 million years ago",
    "foundIn": "China",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Paraves, Eumaniraptoria, Avialae, Ornithurae, Avibrevicauda, Pygostylia, Confuciusornithidae",
    "namedBy": "Hou, Zhou, Gu and Zhang (1995)",
    "typeSpecies": "sanctus",
    "description": "Confuciusornis, a primitive bird-like dinosaur, lived during the Early Cretaceous period in what is now China. It represents one of the earliest known birds, possessing both avian and reptilian characteristics. Fossils of Confuciusornis have provided valuable insights into the evolution of flight and avian features."
  },
  {
    "id": 76,
    "name": "Corythosaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/coryth.jpg",
    "typeOfDinosaur": "large ornithopod",
    "length": 10,
    "weight": 3600,
    "diet": "herbivorous",
    "whenLived": "Late Cretaceous, 76-74 million years ago",
    "foundIn": "Canada, USA",
    "taxonomy": "Dinosauria, Ornithischia, Ornithopoda, Hadrosauridae, Lambeosaurinae",
    "namedBy": "Brown (1914)",
    "typeSpecies": "casuarius",
    "description": "Corythosaurus was a duck-billed dinosaur known for its distinctive crest, resembling a helmet. It roamed North America during the Late Cretaceous period. This herbivore likely traveled in herds, using its crested head for communication and possibly defense."
  },
  {
    "id": 78,
    "name": "Dacentrurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/dacentr.jpg",
    "typeOfDinosaur": "armoured dinosaur",
    "length": 6,
    "weight": 950,
    "diet": "herbivorous",
    "whenLived": "Late Jurassic, 154-150 million years ago",
    "foundIn": "England, France, Portugal, United Kingdom",
    "taxonomy": "Dinosauria, Ornithischia, Thyreophora, Stegosauria, Stegosauridae",
    "namedBy": "Lucas (1902)",
    "typeSpecies": "armatus",
    "description": "Dacentrurus was the first stegosaur ever discovered."
  },
  {
    "id": 79,
    "name": "Daspletosaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/daspelet.jpg",
    "typeOfDinosaur": "large theropod",
    "length": 9,
    "weight": 3200,
    "diet": "carnivorous",
    "whenLived": "Late Cretaceous, 76-74 million years ago",
    "foundIn": "Canada",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Tyrannosauroidea, Tyrannosauridae, Tyrannosaurinae",
    "namedBy": "Russell (1970)",
    "typeSpecies": "torosus",
    "description": "Daspletosaurus was a formidable predator that lived during the Late Cretaceous period, approximately 77 to 75 million years ago. It was a large theropod dinosaur, similar to Tyrannosaurus rex but slightly smaller. Daspletosaurus had sharp teeth and powerful jaws, making it a fearsome carnivore in its ecosystem."
  },
  {
    "id": 80,
    "name": "Datousaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/datou.jpg",
    "typeOfDinosaur": "sauropod",
    "length": 15,
    "weight": 10000,
    "diet": "herbivorous",
    "whenLived": "Mid Jurassic, 170 million years ago",
    "foundIn": "China",
    "taxonomy": "Dinosauria, Saurischia, Sauropodomorpha, Sauropoda",
    "namedBy": "Dong and Tang (1984)",
    "typeSpecies": "bashanensis",
    "description": "Datousaurus was a herbivorous sauropod dinosaur that lived during the Middle Jurassic period, around 168 to 163 million years ago. It roamed the ancient landscapes of what is now China. With its long neck and tail, Datousaurus was a massive creature, reaching lengths of about 15 meters."
  },
  {
    "id": 81,
    "name": "Deinocheirus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/deinoc.jpg",
    "typeOfDinosaur": "large theropod",
    "length": 10,
    "weight": "N/A",
    "diet": "omnivorous",
    "whenLived": "Late Cretaceous, 70-66 million years ago",
    "foundIn": "Mongolia",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Ornithomimosauria",
    "namedBy": "OsmÃ³lska and Roniewicz (1970)",
    "typeSpecies": "mirificus",
    "description": "Originally, scientists only had a pair of arm bones with big, long claws to learn about Deinocheirus. But in 2014, new material revealed that it had a unique, large hump on its back, supported by its back bones. Now we know that it was a truly bizarre-looking creature, with huge, clawed hands, a beaked head like a duck and a hump like a camel."
  },
  {
    "id": 83,
    "name": "Deltadromeus",
    "imageSrc": "N/A",
    "typeOfDinosaur": "large theropod",
    "length": 8.1,
    "weight": "N/A",
    "diet": "carnivorous",
    "whenLived": "Late Cretaceous, 99-94 million years ago",
    "foundIn": "Morocco",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Neotheropoda, Tetanurae, Avetheropoda, Coelurosauria",
    "namedBy": "Sereno, Duthiel, Iarochene, Larsson, Lyon, Magwene, Sidor, Varricchio and Wilson (1996)",
    "typeSpecies": "agilis",
    "description": "Deltadromeus is known from a single partial skeleton."
  },
  {
    "id": 84,
    "name": "Dicraeosaurus",
    "imageSrc": "N/A",
    "typeOfDinosaur": "sauropod",
    "length": 20,
    "weight": "N/A",
    "diet": "herbivorous",
    "whenLived": "Late Jurassic, 150-135 million years ago",
    "foundIn": "Tanzania",
    "taxonomy": "Dinosauria, Saurischia, Sauropodomorpha, Sauropoda, Eusauropoda, Neosauropoda, Diplodocoidea, Dicraeosauridae",
    "namedBy": "Janensch (1914)",
    "typeSpecies": "hansemanni",
    "description": "This dinosaur is named 'forked lizard' because of the forked spines in its backbone."
  },
  {
    "id": 85,
    "name": "Dilophosaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/dilopho.jpg",
    "typeOfDinosaur": "large theropod",
    "length": 6,
    "weight": 300,
    "diet": "carnivorous",
    "whenLived": "Early Jurassic, 190 million years ago",
    "foundIn": "USA",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Neotheropoda, Dilophosauridae",
    "namedBy": "N/A",
    "typeSpecies": "wetherilli",
    "description": "Dilophosaurus was a fast-moving meat-eating dinosaur.  A kink in its upper jaw may mean that it ate a certain kind of food, or attacked by gripping and holding on to prey - modern crocodiles have a similar kink.The pair of thin bony crests on its head may have been for display."
  },
  {
    "id": 87,
    "name": "Dracorex",
    "imageSrc": "N/A",
    "typeOfDinosaur": "pachycephalosaur",
    "length": 4,
    "weight": "N/A",
    "diet": "herbivorous",
    "whenLived": "Late Cretaceous, 66 million years ago",
    "foundIn": "USA",
    "taxonomy": "Dinosauria, Ornithischia, Neornithischia, Cerapoda, Marginocephalia, Pachycephalosauria, Pachycephalosauridae",
    "namedBy": "Bakker, Sullivan, Porter, Larson and Saulsbury (2006)",
    "typeSpecies": "hogwartsia",
    "description": "Dracorex is a pachycephalosaur from the end of the Cretaceous Period which was identified after the discovery of a spectacular skull. The skull lacks the dome characteristic of this group and instead has spikes and frills reminiscent of a mythical dragon. After studying the skull, scientists named the species Dracorex hogwartsia, the 'dragon king of Hogwarts', after the fictional Hogwarts School in the Harry Potter books by JK Rowling. Some scientists think the skull may actually belong to a young Pachycephalosaurus."
  },
  {
    "id": 88,
    "name": "Dreadnoughtus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/dreadnoughtus-c.jpg",
    "typeOfDinosaur": "sauropod",
    "length": 26,
    "weight": "N/A",
    "diet": "herbivorous",
    "whenLived": "Late Cretaceous, 76-70 million years ago",
    "foundIn": "Argentina",
    "taxonomy": "Dinosauria, Saurischia, Sauropodomorpha, Sauropoda, Eusauropoda, Neosauropoda, Macronaria, Camarasauromorpha, Titanosauriformes, Titanosauria",
    "namedBy": "Lacovara and colleagues (2014)",
    "typeSpecies": "schrani",
    "description": "Dreadnoughtus was a giant sauropod, a member of the group called titanosaurs. It lived in South America during the Cretaceous Period.Many titanosaurs are known from only a few bones, but scientists have found around half of the skeleton of Dreadnoughtus. This means it is better understood than some of the other giant sauropods of the time. The skull has never been found though. Thanks to having a good amount of fossil material to study, experts have been able to estimate the weight of this enormous dinosaur. A calculation published in 2020 puts the animal's weight at around 48 metric tons. That's about the same as eight African elephants! However, depending on the method used, estimates have ranged from 22 tonnes to 59 tonnes. The remains of only two Dreadnoughtus specimens have ever been uncovered. Scientists found that the largest one wasn't even fully grown. This means that nobody knows for sure how big this dinosaur could really get. The name Dreadnoughtus means 'fears nothing', because its enormous size would have made it difficult for predators to attack. It is also a reference to the dreadnoughts - huge battleships that fought in wars of the early twentieth century.Dreadnoughtus was so huge that it would have had to eat nearly constantly and spend as little energy as possible in order to survive. The dinosaur's long neck meant that it would have been able to reach a large variety of plant food sources without moving its body too much. This way, it would have been able to eat vast amounts without burning too many calories.The biggest Dreadnoughtus specimen ever found was not fully grown when it died, so scientists can't say for sure how large this dinosaur could grow in adulthood.As far as anyone can tell, some other huge titanosaurs, such as Patagotitan and Argentinosaurus, may have been bigger than Dreadnoughtus.Dreadnoughtus features in the Apple TV+ documentary, Prehistoric Planet. In this show, the dinosaur can be seen with inflatable air sacs on its neck. While there is no fossil evidence to show that Dreadnoughtus really had visible air sacs, all sauropod dinosaurs had internal air sacs.  These made the enormous animals lighter than they would otherwise have been. There is no doubt that many dinosaurs would have had surprising external soft tissue features. These features rarely get preserved as fossils - so for now, we can only guess at the unusual features that Dreadnoughtus might have had."
  },
  {
    "id": 91,
    "name": "Dryosaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/dryo.jpg",
    "typeOfDinosaur": "small ornithopod",
    "length": 4,
    "weight": "N/A",
    "diet": "herbivorous",
    "whenLived": "Late Jurassic, 155-140 million years ago",
    "foundIn": "Tanzania, USA",
    "taxonomy": "Dinosauria, Ornithischia, Ornithopoda, Euornithopoda, Iguanadontia, Euiguanadontia, Dryomorpha, Dryosauridae",
    "namedBy": "Marsh (1894)",
    "typeSpecies": "altus",
    "description": "N/A"
  },
  {
    "id": 92,
    "name": "Dryptosaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/drypto.jpg",
    "typeOfDinosaur": "large theropod",
    "length": 6.4,
    "weight": "N/A",
    "diet": "carnivorous",
    "whenLived": "Late Cretaceous, 84-66 million years ago",
    "foundIn": "USA",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Tyrannosauroidea",
    "namedBy": "Cope (1866)",
    "typeSpecies": "aquilunguis",
    "description": "This dinosaur was originally named Laelaps by Edward Drinker Cope. His rival Othniel Charles Marsh realised that this name was already being used for a mite and renamed the dinosaur Dryptosaurus in 1877."
  },
  {
    "id": 93,
    "name": "Dubreuillosaurus",
    "imageSrc": "N/A",
    "typeOfDinosaur": "large theropod",
    "length": "N/A",
    "weight": "N/A",
    "diet": "carnivorous",
    "whenLived": "Late Jurassic, 169-164 million years ago",
    "foundIn": "France",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Megalosauridae, Eustreptospondylinae",
    "namedBy": "Allain (2005)",
    "typeSpecies": "valesdunensis",
    "description": "Partial skull and partial skeletons of Dubreuillosaurus have been found, but not enough to work out its overall size, although we know it was a large dinosaur."
  },
  {
    "id": 94,
    "name": "Edmontonia",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/Edmontonia.jpg",
    "typeOfDinosaur": "armoured dinosaur",
    "length": 4,
    "weight": "N/A",
    "diet": "herbivorous",
    "whenLived": "Late Cretaceous, 76-74 million years ago",
    "foundIn": "Canada",
    "taxonomy": "Dinosauria, Ornithischia, Thyreophora, Ankylosauria, Nodosauridae",
    "namedBy": "Sternberg (1928)",
    "typeSpecies": "longiceps",
    "description": "N/A"
  },
  {
    "id": 95,
    "name": "Edmontosaurus",
    "imageSrc": "N/A",
    "typeOfDinosaur": "large ornithopod",
    "length": 13,
    "weight": 3400,
    "diet": "herbivorous",
    "whenLived": "Late Cretaceous, 76-66 million years ago",
    "foundIn": "Canada",
    "taxonomy": "Dinosauria, Ornithischia, Ornithopoda, Hadrosauridae, Euhadrosauria, Hadrosaurinae",
    "namedBy": "Lambe (1917)",
    "typeSpecies": "regalis",
    "description": "Hard conifer needles, twigs and seeeds have been found in Edmontosaurus stomachs. Mummified specimens have some preserved skin, so we know its texture (but not the colour)."
  },
  {
    "id": 96,
    "name": "Einiosaurus",
    "imageSrc": "N/A",
    "typeOfDinosaur": "ceratopsian",
    "length": 6,
    "weight": "N/A",
    "diet": "herbivorous",
    "whenLived": "Late Cretaceous, 74 million years ago",
    "foundIn": "USA",
    "taxonomy": "Dinosauria, Ornithischia, Neornithischia, Cerapoda, Marginocephalia, Ceratopsia, Neoceratopsia, Coronosauria, Ceratopsidae, Centrosaurinae",
    "namedBy": "Sampson  (1995)",
    "typeSpecies": "procurvicornis",
    "description": "Einiosaurus had a large downward-curving nasal horn."
  },
  {
    "id": 97,
    "name": "Elaphrosaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/Elaphrosaurus.jpg",
    "typeOfDinosaur": "large theropod",
    "length": 6.2,
    "weight": "N/A",
    "diet": "carnivorous",
    "whenLived": "Late Jurassic, 154-151 million years ago",
    "foundIn": "Tanzania",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Neotheropoda, Ceratosauria, Neoceratosauria",
    "namedBy": "Janensch (1920)",
    "typeSpecies": "bambergi",
    "description": "N/A"
  },
  {
    "id": 98,
    "name": "Emausaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/Emausaurus.jpg",
    "typeOfDinosaur": "armoured dinosaur",
    "length": 2,
    "weight": "N/A",
    "diet": "herbivorous",
    "whenLived": "Mid Jurassic, 190-180 million years ago",
    "foundIn": "Germany",
    "taxonomy": "Dinosauria, Ornithischia, Thyreophora",
    "namedBy": "Haubold (1991)",
    "typeSpecies": "ernsti",
    "description": "N/A"
  },
  {
    "id": 99,
    "name": "Eolambia",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/Eolambia.jpg",
    "typeOfDinosaur": "large ornithopod",
    "length": "N/A",
    "weight": "N/A",
    "diet": "herbivorous",
    "whenLived": "Late Cretaceous, 99-94 million years ago",
    "foundIn": "USA",
    "taxonomy": "Dinosauria, Ornithischia, Ornithopoda, Euornithopoda, Iguanadontia, Euiguanadontia, Dryomorpha, Ankylopollexia, Iguanodontoidea",
    "namedBy": "Kirkland (1998)",
    "typeSpecies": "caroljonesa",
    "description": "Eolambia is known from the skulls and postcrania of several individuals, both juveniles and adults."
  },
  {
    "id": 100,
    "name": "Eoraptor",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/eor.jpg",
    "typeOfDinosaur": "small theropod",
    "length": 1.7,
    "weight": 10,
    "diet": "carnivorous",
    "whenLived": "Late Triassic, 228 million years ago",
    "foundIn": "Argentina",
    "taxonomy": "Dinosauria, Saurischia, Theropoda",
    "namedBy": "Sereno, Forster, Rogers and Monetta (1993)",
    "typeSpecies": "lunensis",
    "description": "N/A"
  },
  {
    "id": 101,
    "name": "Eotyrannus",
    "imageSrc": "N/A",
    "typeOfDinosaur": "large theropod",
    "length": 5,
    "weight": "N/A",
    "diet": "carnivorous",
    "whenLived": "Early Cretaceous, 127-121 million years ago",
    "foundIn": "England, United Kingdom",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Tyrannosauroidea",
    "namedBy": "Hutt, Naish, Martill, Barker and Newberry (2001)",
    "typeSpecies": "lengi",
    "description": "Eotyrannus is known from a partial skull and partial skeleton."
  },
  {
    "id": 102,
    "name": "Equijubus",
    "imageSrc": "N/A",
    "typeOfDinosaur": "large ornithopod",
    "length": "N/A",
    "weight": "N/A",
    "diet": "herbivorous",
    "whenLived": "Early Cretaceous, 127-99 million years ago",
    "foundIn": "China",
    "taxonomy": "Dinosauria, Ornithischia, Ornithopoda, Euornithopoda, Iguanadontia, Euiguanadontia, Dryomorpha, Ankylopollexia, Iguanodontoidea",
    "namedBy": "You, Luo, Shubin, Witmer, Tang and Tang (2003)",
    "typeSpecies": "normani",
    "description": "Known from skull and postcrania, Equijubus is thought to be the earliest duck-billed dinosaur (hadrosaur)."
  },
  {
    "id": 103,
    "name": "Erketu",
    "imageSrc": "N/A",
    "typeOfDinosaur": "sauropod",
    "length": 15,
    "weight": "N/A",
    "diet": "herbivorous",
    "whenLived": "Early Cretaceous",
    "foundIn": "Mongolia",
    "taxonomy": "Dinosauria, Saurischia, Sauropodomorpha, Sauropoda, Eusauropoda, Neosauropoda, Macronaria, Camarasauromorpha, Titanosauriformes, Titanosauria",
    "namedBy": "Ksepka and Norell (2006)",
    "typeSpecies": "ellisoni",
    "description": "Erketu is known from articulated cervical vertebrae (backbone), a sternal plate (breastbone) and an articulated lower leg."
  },
  {
    "id": 104,
    "name": "Erlikosaurus",
    "imageSrc": "N/A",
    "typeOfDinosaur": "small theropod",
    "length": 3.4,
    "weight": "N/A",
    "diet": "omnivorous",
    "whenLived": "Late Cretaceous, 99-89 million years ago",
    "foundIn": "Mongolia",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Neotheropoda, Tetanurae, Avetheropoda, Coelurosauria, Tyrannoraptora, Maniraptoriformes, Maniraptora, Therizinosauroidea, Therizinosauridae",
    "namedBy": "Perle vide Barsbold and Perle (1980)",
    "typeSpecies": "andrewsi",
    "description": "Erlikosaurus is known from a skull and partial skeleton."
  },
  {
    "id": 105,
    "name": "Euhelopus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/Euhelopus.jpg",
    "typeOfDinosaur": "sauropod",
    "length": 10,
    "weight": "N/A",
    "diet": "herbivorous",
    "whenLived": "Late Jurassic, 154-142 million years ago",
    "foundIn": "China",
    "taxonomy": "Dinosauria, Saurischia, Sauropodomorpha, Sauropoda, Eusauropoda",
    "namedBy": "Wiman (1929)",
    "typeSpecies": "zdanskyi",
    "description": "Euhelopus is known from a skull and partial postcranial skeletons."
  },
  {
    "id": 106,
    "name": "Euoplocephalus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/euoplo.jpg",
    "typeOfDinosaur": "armoured dinosaur",
    "length": 7,
    "weight": 2000,
    "diet": "herbivorous",
    "whenLived": "Late Cretaceous, 76-70 million years ago",
    "foundIn": "Canada, USA",
    "taxonomy": "Dinosauria, Ornithischia, Thyreophora, Ankylosauria, Ankylosauridae",
    "namedBy": "N/A",
    "typeSpecies": "tutus",
    "description": "Euoplocephalus had bony spikes and armour plating on its back, and a bony tail club used for defence."
  },
  {
    "id": 107,
    "name": "Europasaurus",
    "imageSrc": "N/A",
    "typeOfDinosaur": "sauropod",
    "length": 6.2,
    "weight": "N/A",
    "diet": "herbivorous",
    "whenLived": "Late Jurassic, 154-151 million years ago",
    "foundIn": "Germany",
    "taxonomy": "Dinosauria, Saurischia, Sauropodomorpha, Sauropoda, Eusauropoda, Neosauropoda, Macronaria",
    "namedBy": "Sander, Mateus, Laven and KnÃ¶tschke (2006)",
    "typeSpecies": "holgeri",
    "description": "Although Europasaurus was a dwarf sauropod, it still grew to around 6m long."
  },
  {
    "id": 108,
    "name": "Eustreptospondylus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/Eustreptospondylus.jpg",
    "typeOfDinosaur": "large theropod",
    "length": 7,
    "weight": "N/A",
    "diet": "carnivorous",
    "whenLived": "Mid Jurassic, 165 million years ago",
    "foundIn": "England, United Kingdom",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Megalosauridae, Eustreptospondylinae",
    "namedBy": "Walker (1964)",
    "typeSpecies": "oxoniensis",
    "description": "N/A"
  },
  {
    "id": 109,
    "name": "Fukuiraptor",
    "imageSrc": "N/A",
    "typeOfDinosaur": "large theropod",
    "length": 4.2,
    "weight": "N/A",
    "diet": "carnivorous",
    "whenLived": "Early Cretaceous, 121-99 million years ago",
    "foundIn": "Japan",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Neotheropoda, Tetanurae, Avetheropoda, Carnosauria",
    "namedBy": "Azuma and Currie (2000)",
    "typeSpecies": "kitadaniensis",
    "description": "N/A"
  },
  {
    "id": 110,
    "name": "Fukuisaurus",
    "imageSrc": "N/A",
    "typeOfDinosaur": "large ornithopod",
    "length": 4.7,
    "weight": "N/A",
    "diet": "herbivorous",
    "whenLived": "Early Cretaceous, 121-99 million years ago",
    "foundIn": "Japan",
    "taxonomy": "Dinosauria, Ornithischia, Ornithopoda, Euornithopoda, Iguanadontia, Euiguanadontia, Dryomorpha, Ankylopollexia, Iguanodontoidea",
    "namedBy": "Kobayashi and Azuma (2003)",
    "typeSpecies": "tetoriensius",
    "description": "Fukuisaurus is only known from a skull, so the rest of the reconstruction is guesswork based on similar dinosaurs."
  },
  {
    "id": 111,
    "name": "Gallimimus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/gallim.jpg",
    "typeOfDinosaur": "large theropod",
    "length": 6,
    "weight": 200,
    "diet": "omnivorous",
    "whenLived": "Late Cretaceous, 74-70 million years ago",
    "foundIn": "Mongolia",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Ornithomimosauria, Ornithomimidae",
    "namedBy": "OsmÃ³lska, Roniewicz and Barsbold (1972)",
    "typeSpecies": "bullatus",
    "description": "N/A"
  },
  {
    "id": 112,
    "name": "Gargoyleosaurus",
    "imageSrc": "N/A",
    "typeOfDinosaur": "armoured dinosaur",
    "length": 4,
    "weight": "N/A",
    "diet": "herbivorous",
    "whenLived": "Late Jurassic, 154-142 million years ago",
    "foundIn": "USA",
    "taxonomy": "Dinosauria, Ornithischia, Thyreophora, Ankylosauria",
    "namedBy": "Carpenter, Miles and Cloward (1998)",
    "typeSpecies": "parkpinorum",
    "description": "Gargoyleosaurus is known from a skull and partial postcranium, which was found partially articulated (the bones were joined as they would have been when the dinosaur was alive)."
  },
  {
    "id": 113,
    "name": "Garudimimus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/Garudimimus.jpg",
    "typeOfDinosaur": "large theropod",
    "length": 4.7,
    "weight": "N/A",
    "diet": "omnivorous",
    "whenLived": "Late Cretaceous, 99-89 million years ago",
    "foundIn": "Mongolia",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Ornithomimosauria",
    "namedBy": "Barsbold (1981)",
    "typeSpecies": "brevipes",
    "description": "N/A"
  },
  {
    "id": 114,
    "name": "Gasosaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/gaso.jpg",
    "typeOfDinosaur": "small theropod",
    "length": 4,
    "weight": "N/A",
    "diet": "carnivorous",
    "whenLived": "Mid Jurassic, 170-160 million years ago",
    "foundIn": "China",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Neotheropoda, Tetanurae, Avetheropoda",
    "namedBy": "Dong and Tang (1985)",
    "typeSpecies": "constructus",
    "description": "N/A"
  },
  {
    "id": 115,
    "name": "Gasparinisaura",
    "imageSrc": "N/A",
    "typeOfDinosaur": "small ornithopod",
    "length": 0.8,
    "weight": "N/A",
    "diet": "herbivorous",
    "whenLived": "Late Cretaceous, 86-71 million years ago",
    "foundIn": "Argentina",
    "taxonomy": "Dinosauria, Ornithischia, Ornithopoda, Euornithopoda",
    "namedBy": "Coria and Salgado (1996)",
    "typeSpecies": "cincosaltensis",
    "description": "N/A"
  },
  {
    "id": 116,
    "name": "Gastonia",
    "imageSrc": "N/A",
    "typeOfDinosaur": "armoured dinosaur",
    "length": 4.6,
    "weight": "N/A",
    "diet": "herbivorous",
    "whenLived": "Early Cretaceous, 142-127 million years ago",
    "foundIn": "USA",
    "taxonomy": "Dinosauria, Ornithischia, Thyreophora, Ankylosauria",
    "namedBy": "Kirkland (1998)",
    "typeSpecies": "burgei",
    "description": "Gastonia is known from a skull and the partial skeletons of several individuals."
  },
  {
    "id": 118,
    "name": "Gilmoreosaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/gilmore.jpg",
    "typeOfDinosaur": "large ornithopod",
    "length": 6,
    "weight": "N/A",
    "diet": "herbivorous",
    "whenLived": "Late Cretaceous, 76-70 million years ago",
    "foundIn": "China",
    "taxonomy": "Dinosauria, Ornithischia, Ornithopoda, Hadrosauridae",
    "namedBy": "Brett-Surman (1979)",
    "typeSpecies": "mongoliensis",
    "description": "N/A"
  },
  {
    "id": 119,
    "name": "Giraffatitan",
    "imageSrc": "N/A",
    "typeOfDinosaur": "sauropod",
    "length": 23,
    "weight": "N/A",
    "diet": "herbivorous",
    "whenLived": "Late Jurassic, 154-142 million years ago",
    "foundIn": "Tanzania",
    "taxonomy": "Dinosauria, Saurischia, Sauropodomorpha, Sauropoda, Eusauropoda, Neosauropoda, Macronaria, Camarasauromorpha, Titanosauriformes, Brachiosauridae",
    "namedBy": "Janensch (1914)",
    "typeSpecies": "brancai",
    "description": "Considered to be distinct from Brachiosaurus by some scientists, Giraffatitan is known from the fossils of several individuals."
  },
  {
    "id": 120,
    "name": "Gobisaurus",
    "imageSrc": "N/A",
    "typeOfDinosaur": "armoured dinosaur",
    "length": 5,
    "weight": "N/A",
    "diet": "herbivorous",
    "whenLived": "Early Cretaceous, 121-99 million years ago",
    "foundIn": "China",
    "taxonomy": "Dinosauria, Ornithischia, Thyreophora, Ankylosauria, Ankylosauridae",
    "namedBy": "Vickaryous, Russell, Currie and Zhao (2001)",
    "typeSpecies": "domoculus",
    "description": "Gobisaurus is known from a skull and postcranium. The size of the skull suggests that the dinosaur was up to 5m long."
  },
  {
    "id": 121,
    "name": "Gorgosaurus",
    "imageSrc": "N/A",
    "typeOfDinosaur": "large theropod",
    "length": 8.6,
    "weight": "N/A",
    "diet": "carnivorous",
    "whenLived": "Late Cretaceous, 80-73 million years ago",
    "foundIn": "Canada, USA",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Tyrannosauroidea, Tyrannosauridae, Albertosaurinae",
    "namedBy": "Lamb (1914)",
    "typeSpecies": "libratus",
    "description": "Gorgosaurus is known from at least 12 complete or almost complete skulls and several partial skeletons."
  },
  {
    "id": 122,
    "name": "Goyocephale",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/Goyocephale.jpg",
    "typeOfDinosaur": "pachycephalosaur",
    "length": 2,
    "weight": "N/A",
    "diet": "herbivorous",
    "whenLived": "Late Cretaceous, 81-75 million years ago",
    "foundIn": "Mongolia",
    "taxonomy": "Dinosauria, Ornithischia, Neornithischia, Cerapoda, Marginocephalia, Pachycephalosauria, Goyocephala",
    "namedBy": "Perle, MaryaÅ ska and OsmÃ³lska (1982)",
    "typeSpecies": "lattimorei",
    "description": "N/A"
  },
  {
    "id": 123,
    "name": "Graciliceratops",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/Graciliceratops.jpg",
    "typeOfDinosaur": "ceratopsian",
    "length": "N/A",
    "weight": "N/A",
    "diet": "herbivorous",
    "whenLived": "Late Cretaceous, 99-84 million years ago",
    "foundIn": "Mongolia",
    "taxonomy": "Dinosauria, Ornithischia, Neornithischia, Cerapoda, Marginocephalia, Ceratopsia, Neoceratopsia",
    "namedBy": "Sereno (2000)",
    "typeSpecies": "mongoliensis",
    "description": "A partial skull and skeleton of Graciliceratops have been found. This was a tiny dinosaur, it may have only been 80cm long."
  },
  {
    "id": 124,
    "name": "Gryposaurus",
    "imageSrc": "N/A",
    "typeOfDinosaur": "large ornithopod",
    "length": 10,
    "weight": "N/A",
    "diet": "herbivorous",
    "whenLived": "Late Cretaceous, 86-71 million years ago",
    "foundIn": "Canada, USA",
    "taxonomy": "Dinosauria, Ornithischia, Ornithopoda, Hadrosauridae, Euhadrosauria, Hadrosaurinae",
    "namedBy": "Lambe (1914)",
    "typeSpecies": "notabilis",
    "description": "Gryposaurus is known from several skeletons, including one which is fully articulated (the bones were joined as they would have been when the dinosaur was alive)."
  },
  {
    "id": 125,
    "name": "Guaibasaurus",
    "imageSrc": "N/A",
    "typeOfDinosaur": "prosauropod",
    "length": 1.8,
    "weight": "N/A",
    "diet": "herbivorous",
    "whenLived": "Late Triassic, 221-210 million years ago",
    "foundIn": "Brazil",
    "taxonomy": "Dinosauria, Saurischia, Theropoda",
    "namedBy": "Bonaparte, Ferigolo and Ribeiro (1999)",
    "typeSpecies": "candelariensis",
    "description": "This early dinosaur is known from a partial skeleton. Scientists are not sure how it relates to later dinosaurs."
  },
  {
    "id": 126,
    "name": "Guanlong",
    "imageSrc": "N/A",
    "typeOfDinosaur": "small theropod",
    "length": 3,
    "weight": "N/A",
    "diet": "carnivorous",
    "whenLived": "Late Jurassic, 159-154 million years ago",
    "foundIn": "China",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Tyrannosauroidea",
    "namedBy": "Xu, Clark, Forster, Norell, Erickson, Eberth, Jia and Zhao (2006)",
    "typeSpecies": "wucaii",
    "description": "Guanlong had an air-filled crest on its head. It is the earliest known tyrannosauroid (Tyrannosaurus-like) dinosaur."
  },
  {
    "id": 127,
    "name": "Hadrosaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/hadro.jpg",
    "typeOfDinosaur": "large ornithopod",
    "length": 9,
    "weight": "N/A",
    "diet": "herbivorous",
    "whenLived": "Late Cretaceous, 78-74 million years ago",
    "foundIn": "USA",
    "taxonomy": "Dinosauria, Ornithischia, Ornithopoda, Hadrosauridae, Euhadrosauria, Hadrosaurinae",
    "namedBy": "Leidy (1858)",
    "typeSpecies": "foulkii",
    "description": "Hadrosaurus was a large, two-legged herbivore from the hadrosaur group of dinosaurs. It would have cropped vegetation with its beak.It was called Hadrosaurus, which means 'bulky lizard', because it was so large and so heavy. It was the first hadrosaur ever named.Hadrosaurus may have been hunted by large tyrannosaurs but giant crocodiles would have also been a danger in Cretaceous North America."
  },
  {
    "id": 128,
    "name": "Hagryphus",
    "imageSrc": "N/A",
    "typeOfDinosaur": "small theropod",
    "length": 3,
    "weight": "N/A",
    "diet": "omnivorous",
    "whenLived": "N/A",
    "foundIn": "USA",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Neotheropoda, Tetanurae, Avetheropoda, Coelurosauria, Tyrannoraptora, Maniraptoriformes, Maniraptora, Oviraptorosauria",
    "namedBy": "Zanno and Sampson (2005)",
    "typeSpecies": "giganteus",
    "description": "Hagryphus is known from only a left hand, fragmentary metatarsals and pedal phalanges (part of a foot), so this reconstruction is based on these and Chirostenotes, a very similar dinosaur."
  },
  {
    "id": 129,
    "name": "Haplocanthosaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/Haplocanthosaurus.jpg",
    "typeOfDinosaur": "sauropod",
    "length": 21.5,
    "weight": "N/A",
    "diet": "herbivorous",
    "whenLived": "Late Jurassic, 154-142 million years ago",
    "foundIn": "USA",
    "taxonomy": "Dinosauria, Saurischia, Sauropodomorpha, Sauropoda, Eusauropoda, Neosauropoda, Macronaria, Camarasauromorpha, Camarasauridae",
    "namedBy": "Hatcher (1903)",
    "typeSpecies": "priscus",
    "description": "Haplocanthosaurus is known from partial skeletons that lack skulls,  so the shape of the head in reconstructions is based on similar dinosaurs."
  },
  {
    "id": 130,
    "name": "Herrerasaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/herrera.jpg",
    "typeOfDinosaur": "early dinosaur",
    "length": 3,
    "weight": "N/A",
    "diet": "carnivorous",
    "whenLived": "Late Triassic, 228 million years ago",
    "foundIn": "Argentina",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Herrerasauridae",
    "namedBy": "Reig (1963)",
    "typeSpecies": "ischigualastensis",
    "description": "N/A"
  },
  {
    "id": 131,
    "name": "Hesperosaurus",
    "imageSrc": "N/A",
    "typeOfDinosaur": "armoured dinosaur",
    "length": 6,
    "weight": "N/A",
    "diet": "herbivorous",
    "whenLived": "Late Jurassic, 154-142 million years ago",
    "foundIn": "USA",
    "taxonomy": "Dinosauria, Ornithischia, Thyreophora, Stegosauria, Stegosauridae, Stegosaurinae",
    "namedBy": "Carpenter, Miles and Cloward (2001)",
    "typeSpecies": "mjosi",
    "description": "Hesperosaurus is known from a complete skeleton and a skull."
  },
  {
    "id": 132,
    "name": "Heterodontosaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/hetero.jpg",
    "typeOfDinosaur": "small ornithischian",
    "length": 1.2,
    "weight": "N/A",
    "diet": "herbivorous",
    "whenLived": "Early Jurassic, 205 million years ago",
    "foundIn": "Lesotho, South Africa",
    "taxonomy": "Dinosauria, Ornithischia, Neornithischia, Cerapoda, Heterodontosauridae",
    "namedBy": "Crompton and Charig (1962)",
    "typeSpecies": "tucki",
    "description": "N/A"
  },
  {
    "id": 133,
    "name": "Heyuannia",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/heyuannia.jpg",
    "typeOfDinosaur": "small theropod",
    "length": 2,
    "weight": "N/A",
    "diet": "omnivorous",
    "whenLived": "Late Cretaceous, 72-68 million years ago",
    "foundIn": "Mongolia",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Neotheropoda, Tetanurae, Avetheropoda, Coelurosauria, Tyrannoraptora, Maniraptoriformes, Maniraptora, Oviraptorosauria, Caenagnathoidea, Oviraptoridae, Ingeniinae",
    "namedBy": "Barsbold (1981)",
    "typeSpecies": "yanshini",
    "description": "N/A"
  },
  {
    "id": 134,
    "name": "Homalocephale",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/Homalocephale.jpg",
    "typeOfDinosaur": "pachycephalosaur",
    "length": 1.5,
    "weight": "N/A",
    "diet": "herbivorous",
    "whenLived": "Late Cretaceous, 72-68 million years ago",
    "foundIn": "Mongolia",
    "taxonomy": "Dinosauria, Ornithischia, Neornithischia, Cerapoda, Marginocephalia, Pachycephalosauria, Goyocephala, Homalocephaloidea",
    "namedBy": "MaryaÅ ska and OsmÃ³lska (1974)",
    "typeSpecies": "calathocercos",
    "description": "Homalocephale is known from a complete skull and a nearly complete postcranium."
  },
  {
    "id": 135,
    "name": "Huayangosaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/huayango.jpg",
    "typeOfDinosaur": "armoured dinosaur",
    "length": 4.5,
    "weight": "N/A",
    "diet": "herbivorous",
    "whenLived": "Mid Jurassic, 170-160 million years ago",
    "foundIn": "China",
    "taxonomy": "Dinosauria, Ornithischia, Thyreophora, Stegosauria, Huayangosauridae",
    "namedBy": "Dong, Tang and Zhou (1982)",
    "typeSpecies": "taibaii",
    "description": "N/A"
  },
  {
    "id": 136,
    "name": "Hylaeosaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/hylaeo.jpg",
    "typeOfDinosaur": "armoured dinosaur",
    "length": 5,
    "weight": "N/A",
    "diet": "herbivorous",
    "whenLived": "Early Cretaceous, 150-135 million years ago",
    "foundIn": "England, United Kingdom",
    "taxonomy": "Dinosauria, Ornithischia, Thyreophora, Ankylosauria",
    "namedBy": "Mantell (1833)",
    "typeSpecies": "armatus",
    "description": "A specimen of Hylaeosaurus was one of the 3 fossils first identified as dinosaurs by Richard Owen in 1841."
  },
  {
    "id": 137,
    "name": "Hypacrosaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/Hypacrosaurus.jpg",
    "typeOfDinosaur": "large ornithopod",
    "length": 9,
    "weight": "N/A",
    "diet": "herbivorous",
    "whenLived": "Late Cretaceous, 70 million years ago",
    "foundIn": "Canada, USA",
    "taxonomy": "Dinosauria, Ornithischia, Ornithopoda, Hadrosauridae, Lambeosaurinae",
    "namedBy": "Brown (1913)",
    "typeSpecies": "altispinus",
    "description": "Complete Hypacrosaurus skeletons have been found, from embryos to adults."
  },
  {
    "id": 138,
    "name": "Hypsilophodon",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/hypsil.jpg",
    "typeOfDinosaur": "small ornithopod",
    "length": 2.3,
    "weight": 50,
    "diet": "herbivorous",
    "whenLived": "Early Cretaceous, 125 million years ago",
    "foundIn": "England, Spain, United Kingdom",
    "taxonomy": "Dinosauria, Ornithischia, Ornithopoda, Euornithopoda, Hypsilophodontidae",
    "namedBy": "Huxley (1869)",
    "typeSpecies": "foxii",
    "description": "N/A"
  },
  {
    "id": 140,
    "name": "Indosuchus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/Indosuchus.jpg",
    "typeOfDinosaur": "large theropod",
    "length": 7,
    "weight": "N/A",
    "diet": "carnivorous",
    "whenLived": "Late Cretaceous, 71-66 million years ago",
    "foundIn": "India",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Neotheropoda, Ceratosauria, Neoceratosauria",
    "namedBy": "Huene and Matley (1933)",
    "typeSpecies": "raptorius",
    "description": "An almost complete skeleton of Indosuchus has been found."
  },
  {
    "id": 141,
    "name": "Irritator",
    "imageSrc": "N/A",
    "typeOfDinosaur": "large theropod",
    "length": 6.5,
    "weight": "N/A",
    "diet": "carnivorous",
    "whenLived": "Early Cretaceous, 112-99 million years ago",
    "foundIn": "Brazil",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Spinosauridae, Spinosaurini",
    "namedBy": "Martill, Cruickshank, Frey, Small and Clarke (1996)",
    "typeSpecies": "challengeri",
    "description": "Irritator was quite like Spinosaurus. It is known only from a skull, so the sail is a guess.The type species, Irritator challengeri was named after Professor Challenger from Arthur Conan Doyle's novel  'The Lost World', published in 1912."
  },
  {
    "id": 142,
    "name": "Isisaurus",
    "imageSrc": "N/A",
    "typeOfDinosaur": "sauropod",
    "length": "N/A",
    "weight": "N/A",
    "diet": "herbivorous",
    "whenLived": "Late Cretaceous, 71-66 million years ago",
    "foundIn": "India",
    "taxonomy": "Dinosauria, Saurischia, Sauropodomorpha, Sauropoda, Eusauropoda, Neosauropoda, Macronaria, Camarasauromorpha, Titanosauriformes, Titanosauria, Lithostrotia",
    "namedBy": "Jain and Bandyopadhyay (1997)",
    "typeSpecies": "colberti",
    "description": "This dinosaur is the one most similar to modern-day giraffes. Fungus has been found in its poo!"
  },
  {
    "id": 143,
    "name": "Janenschia",
    "imageSrc": "N/A",
    "typeOfDinosaur": "sauropod",
    "length": 20,
    "weight": "N/A",
    "diet": "herbivorous",
    "whenLived": "Late Jurassic, 154-151 million years ago",
    "foundIn": "Tanzania",
    "taxonomy": "Dinosauria, Saurischia, Sauropodomorpha, Sauropoda, Eusauropoda, Neosauropoda, Macronaria, Camarasauromorpha, Titanosauriformes, Titanosauria",
    "namedBy": "Wild (1991)",
    "typeSpecies": "robusta",
    "description": "N/A"
  },
  {
    "id": 144,
    "name": "Jaxartosaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/Jaxartosaurus.jpg",
    "typeOfDinosaur": "large ornithopod",
    "length": 9,
    "weight": "N/A",
    "diet": "herbivorous",
    "whenLived": "Late Cretaceous, 94-84 million years ago",
    "foundIn": "Kazakhstan",
    "taxonomy": "Dinosauria, Ornithischia, Ornithopoda, Hadrosauridae, Lambeosaurinae",
    "namedBy": "Riabinin (1939)",
    "typeSpecies": "aralensis",
    "description": "Jaxartosaurus is known only from a skull roof and braincase."
  },
  {
    "id": 145,
    "name": "Jingshanosaurus",
    "imageSrc": "N/A",
    "typeOfDinosaur": "prosauropod",
    "length": 5,
    "weight": "N/A",
    "diet": "herbivorous",
    "whenLived": "Early Jurassic, 205-190 million years ago",
    "foundIn": "China",
    "taxonomy": "Dinosauria, Saurischia, Sauropodomorpha, Prosauropoda, Plateosauria",
    "namedBy": "Zhang and Yang (1995)",
    "typeSpecies": "xinwaensis",
    "description": "A complete skeleton and skull of Jingshanosaurus have been found. It was one of the last prosauropods."
  },
  {
    "id": 146,
    "name": "Jinzhousaurus",
    "imageSrc": "N/A",
    "typeOfDinosaur": "large ornithopod",
    "length": "N/A",
    "weight": "N/A",
    "diet": "herbivorous",
    "whenLived": "Early Cretaceous, 127-121 million years ago",
    "foundIn": "China",
    "taxonomy": "Dinosauria, Ornithischia, Ornithopoda, Euornithopoda, Iguanadontia, Euiguanadontia, Dryomorpha, Ankylopollexia, Iguanodontoidea",
    "namedBy": "Wang and Xu (2001)",
    "typeSpecies": "yangi",
    "description": "An almost complete skull and some postcranial remains of this dinosaur have been found."
  },
  {
    "id": 147,
    "name": "Jobaria",
    "imageSrc": "N/A",
    "typeOfDinosaur": "sauropod",
    "length": 21,
    "weight": "N/A",
    "diet": "herbivorous",
    "whenLived": "Early Cretaceous, 132-94 million years ago",
    "foundIn": "Niger",
    "taxonomy": "Dinosauria, Saurischia, Sauropodomorpha, Sauropoda, Eusauropoda, Neosauropoda, Macronaria",
    "namedBy": "Sereno, Beck, Dutheil, Larsson, Lyon, Moussa, Sadleir, Sidor, Varricchio, Wilson and Wilson (1999)",
    "typeSpecies": "tiguidensis",
    "description": "Jobaria is known from a skull and several skeletons."
  },
  {
    "id": 148,
    "name": "Juravenator",
    "imageSrc": "N/A",
    "typeOfDinosaur": "small theropod",
    "length": 0.8,
    "weight": "N/A",
    "diet": "carnivorous",
    "whenLived": "Late Jurassic, 154-151 million years ago",
    "foundIn": "Germany",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Neotheropoda, Tetanurae, Avetheropoda, Coelurosauria, Compsognathidae",
    "namedBy": "GÃ¶hlich & Chiappe (2006)",
    "typeSpecies": "starki",
    "description": "Juravenator was the second non-avian (not bird-like) theropod (small meat-eating dinosaur) to be found in the region of Solnhofen. The type specimen shows impressions of scaly skin along the tail."
  },
  {
    "id": 149,
    "name": "Kentrosaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/kentro.jpg",
    "typeOfDinosaur": "armoured dinosaur",
    "length": 5,
    "weight": "N/A",
    "diet": "herbivorous",
    "whenLived": "Late Jurassic, 155-150 million years ago",
    "foundIn": "Tanzania",
    "taxonomy": "Dinosauria, Ornithischia, Thyreophora, Stegosauria, Stegosauridae, Stegosaurinae",
    "namedBy": "Hennig (1915)",
    "typeSpecies": "aethiopicus",
    "description": "N/A"
  },
  {
    "id": 150,
    "name": "Khaan",
    "imageSrc": "N/A",
    "typeOfDinosaur": "small theropod",
    "length": 1.8,
    "weight": "N/A",
    "diet": "omnivorous",
    "whenLived": "Late Cretaceous, 81-75 million years ago",
    "foundIn": "Mongolia",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Neotheropoda, Tetanurae, Avetheropoda, Coelurosauria, Tyrannoraptora, Maniraptoriformes, Maniraptora, Oviraptorosauria, Caenagnathoidea, Oviraptoridae, Ingeniinae",
    "namedBy": "Clark, Norell and Barsbold (2001)",
    "typeSpecies": "mckennai",
    "description": "This dinosaur is known from 3 skeletons with skulls. It is a beaked dinosaur very similar to Oviraptor, Ingenia and Conchoraptor."
  },
  {
    "id": 151,
    "name": "Kotasaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/Kotasaurus.jpg",
    "typeOfDinosaur": "sauropod",
    "length": 9,
    "weight": "N/A",
    "diet": "herbivorous",
    "whenLived": "Early Jurassic, 205-180 million years ago",
    "foundIn": "India",
    "taxonomy": "Dinosauria, Saurischia, Sauropodomorpha, Sauropoda",
    "namedBy": "Yadagiri (1988)",
    "typeSpecies": "yamanpalliensis",
    "description": "Kotasaurus is known from a nearly complete skeleton that lacks the skull, so the reconstruction uses guesswork based on similar dinosaurs."
  },
  {
    "id": 152,
    "name": "Kritosaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/krito.jpg",
    "typeOfDinosaur": "large ornithopod",
    "length": 8,
    "weight": "N/A",
    "diet": "herbivorous",
    "whenLived": "Late Cretaceous, 78-74 million years ago",
    "foundIn": "Argentina, USA",
    "taxonomy": "Dinosauria, Ornithischia, Ornithopoda, Hadrosauridae, Euhadrosauria, Hadrosaurinae",
    "namedBy": "Brown (1910)",
    "typeSpecies": "navajovius",
    "description": "N/A"
  },
  {
    "id": 153,
    "name": "Lambeosaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/lambeo.jpg",
    "typeOfDinosaur": "large ornithopod",
    "length": 9,
    "weight": "N/A",
    "diet": "herbivorous",
    "whenLived": "Late Cretaceous, 76-74 million years ago",
    "foundIn": "Canada",
    "taxonomy": "Dinosauria, Ornithischia, Ornithopoda, Hadrosauridae, Lambeosaurinae",
    "namedBy": "Parks (1923)",
    "typeSpecies": "lambei",
    "description": "N/A"
  },
  {
    "id": 154,
    "name": "Lapparentosaurus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/Lapparentosaurus.jpg",
    "typeOfDinosaur": "sauropod",
    "length": "N/A",
    "weight": "N/A",
    "diet": "herbivorous",
    "whenLived": "Mid Jurassic, 169-164 million years ago",
    "foundIn": "Madagascar",
    "taxonomy": "Dinosauria, Saurischia, Sauropodomorpha, Sauropoda, Eusauropoda, Neosauropoda, Macronaria, Camarasauromorpha, Titanosauriformes",
    "namedBy": "Bonaparte (1986)",
    "typeSpecies": "madagascariensis",
    "description": "Lapparentosaurus is known from partial skeletons lacking skulls, so reconstructions involve guesswork based on similar dinosaurs."
  },
  {
    "id": 155,
    "name": "Leaellynasaura",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/Leaellynasaura.jpg",
    "typeOfDinosaur": "small ornithopod",
    "length": 2,
    "weight": "N/A",
    "diet": "herbivorous",
    "whenLived": "Early Cretaceous, 115-110 million years ago",
    "foundIn": "Australia",
    "taxonomy": "Dinosauria, Ornithischia, Ornithopoda, Euornithopoda",
    "namedBy": "Rich and Rich (1989)",
    "typeSpecies": "amicagraphica",
    "description": "N/A"
  },
  {
    "id": 156,
    "name": "Leptoceratops",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/Leptoceratops.jpg",
    "typeOfDinosaur": "ceratopsian",
    "length": 3,
    "weight": "N/A",
    "diet": "herbivorous",
    "whenLived": "Late Cretaceous, 67-66 million years ago",
    "foundIn": "Canada, USA",
    "taxonomy": "Dinosauria, Ornithischia, Neornithischia, Cerapoda, Marginocephalia, Ceratopsia, Neoceratopsia, Coronosauria",
    "namedBy": "Brown (1914)",
    "typeSpecies": "gracilis",
    "description": "N/A"
  },
  {
    "id": 158,
    "name": "Liaoceratops",
    "imageSrc": "N/A",
    "typeOfDinosaur": "ceratopsian",
    "length": "N/A",
    "weight": "N/A",
    "diet": "herbivorous",
    "whenLived": "Early Cretaceous, 127-121 million years ago",
    "foundIn": "China",
    "taxonomy": "Dinosauria, Ornithischia, Neornithischia, Cerapoda, Marginocephalia, Ceratopsia, Neoceratopsia",
    "namedBy": "Xu, Makovicky, Wang, Norell and You (2002)",
    "typeSpecies": "yanzigouensis",
    "description": "Two almost complete Liaoceratops skulls have been found."
  },
  {
    "id": 159,
    "name": "Ligabuesaurus",
    "imageSrc": "N/A",
    "typeOfDinosaur": "sauropod",
    "length": 24,
    "weight": "N/A",
    "diet": "herbivorous",
    "whenLived": "Early Cretaceous, 121-99 million years ago",
    "foundIn": "Argentina",
    "taxonomy": "Dinosauria, Saurischia, Sauropodomorpha, Sauropoda, Eusauropoda, Neosauropoda, Macronaria, Camarasauromorpha, Titanosauriformes, Titanosauria",
    "namedBy": "Bonaparte, GonzÃ¡lez Riga and ApesteguÃ­a (2006)",
    "typeSpecies": "leanzai",
    "description": "Ligabuesaurus is known from fragmentary remains, including a maxilla (jawbone) with teeth, 6 cervical and dorsal vertebrae (part of the backbone), and girdle and limb bones."
  },
  {
    "id": 160,
    "name": "Liliensternus",
    "imageSrc": "https://www.nhm.ac.uk/resources/nature-online/life/dinosaurs/dinosaur-directory/images/reconstruction/small/Liliensternus.jpg",
    "typeOfDinosaur": "small theropod",
    "length": 5,
    "weight": "N/A",
    "diet": "carnivorous",
    "whenLived": "Late Triassic, 205-202 million years ago",
    "foundIn": "France, Germany",
    "taxonomy": "Dinosauria, Saurischia, Theropoda, Neotheropoda",
    "namedBy": "Huene (1934)",
    "typeSpecies": "liliensterni",
    "description": "N/A"
  }
]